-----------------------------------------------------------------------------------------------------------------------------------------
       log:  H:\papers\inst\AJPS\RC2\Institutions_AJPS_Rewrite_nov.log
  log type:  text
 opened on:   3 Nov 2005, 15:33:57

. 
. 
. /* Table 1. Distribution of Polity Types 
>    for the 1800-2000 and 1900-2000 Periods                                  */
. 
. tab ourtype if orig==1 & app == 0

    ourtype |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        493       43.09       43.09
          2 |        486       42.48       85.58
          3 |        165       14.42      100.00
------------+-----------------------------------
      Total |      1,144      100.00

. tab ourtype if orig==1 & app==0 & year>=1900

    ourtype |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        400       43.53       43.53
          2 |        359       39.06       82.59
          3 |        160       17.41      100.00
------------+-----------------------------------
      Total |        919      100.00

. 
. stset endnd, id(stsetpolid) failure(status==1) origin(time entrydate) scale(365.25)

                id:  stsetpolid
     failure event:  status == 1
obs. time interval:  (endnd[_n-1], endnd]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time entrydate

------------------------------------------------------------------------------
    15597  total obs.
        0  exclusions
------------------------------------------------------------------------------
    15597  obs. remaining, representing
     1568  subjects
     1264  failures in single failure-per-subject data
 14221.17  total analysis time at risk, at risk from t =         0
                             earliest observed entry t =         0
                                  last observed exit t =  200.9966

. 
. 
. /* Table 2. Log-logistic Regression Estimates of 
>    Polity Survival Time Ratios, 1800-2000                                   */
.    
. /*   Model 1:*/
. 
. xi: streg i.ourtype i.period if app == 0, dist(llogistic) robust tr
i.ourtype         _Iourtype_0-3       (naturally coded; _Iourtype_0 omitted)
i.period          _Iperiod_1-5        (naturally coded; _Iperiod_1 omitted)

         failure _d:  status == 1
   analysis time _t:  (endnd-origin)/365.25
             origin:  time entrydate
                 id:  stsetpolid

Fitting constant-only model:

Iteration 0:   log pseudolikelihood = -1841.9268  
Iteration 1:   log pseudolikelihood = -1796.0792  
Iteration 2:   log pseudolikelihood = -1792.0271  
Iteration 3:   log pseudolikelihood =  -1792.016  
Iteration 4:   log pseudolikelihood =  -1792.016  

Fitting full model:

Iteration 0:   log pseudolikelihood =  -1792.016  
Iteration 1:   log pseudolikelihood = -1732.8983  
Iteration 2:   log pseudolikelihood = -1709.4986  
Iteration 3:   log pseudolikelihood = -1709.4741  
Iteration 4:   log pseudolikelihood = -1709.4741  

Log-logistic regression -- accelerated failure-time form 

No. of subjects      =         1144                Number of obs   =     14116
No. of failures      =          985
Time at risk         =  13165.75162
                                                   Wald chi2(6)    =    135.98
Log pseudolikelihood =   -1709.4741                Prob > chi2     =    0.0000

                       (standard errors adjusted for clustering on stsetpolid)
------------------------------------------------------------------------------
             |               Robust
          _t |  Tm. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 _Iourtype_2 |   1.652969   .1315538     6.31   0.000     1.414232    1.932007
 _Iourtype_3 |   3.781072   .5557743     9.05   0.000     2.834641    5.043498
  _Iperiod_2 |   .5628867   .1509803    -2.14   0.032     .3327419    .9522138
  _Iperiod_3 |   .4760444   .1228711    -2.88   0.004     .2870418    .7894957
  _Iperiod_4 |   .3295415   .0771388    -4.74   0.000     .2082867    .5213853
  _Iperiod_5 |    .311898   .0728159    -4.99   0.000     .1973743    .4928727
-------------+----------------------------------------------------------------
     /ln_gam |  -.3418745   .0251841   -13.58   0.000    -.3912345   -.2925146
-------------+----------------------------------------------------------------
       gamma |   .7104373   .0178917                      .6762216    .7463844
------------------------------------------------------------------------------

. 
. /* Table 3. Log-logistic Regression Estimates of Different Polity Types’ 
>    Survival Time-Ratios, 1900-2000                                          */
. /*   Model 2: Based on our definition of regime duration                    */
. 
. xi: streg i.ourtype cgdpcap gdpsq laggdpgr avgnabo firstpol i.period if app == 0 & year >=1900, dist(llogistic) robust tr
i.ourtype         _Iourtype_0-3       (naturally coded; _Iourtype_0 omitted)
i.period          _Iperiod_1-5        (naturally coded; _Iperiod_1 omitted)

         failure _d:  status == 1
   analysis time _t:  (endnd-origin)/365.25
             origin:  time entrydate
                 id:  stsetpolid
note: _Iperiod_2 dropped due to collinearity
note: _Iperiod_3 dropped due to collinearity

Fitting constant-only model:

Iteration 0:   log pseudolikelihood = -1017.3882  
Iteration 1:   log pseudolikelihood = -993.07054  
Iteration 2:   log pseudolikelihood = -985.68753  
Iteration 3:   log pseudolikelihood = -985.68636  
Iteration 4:   log pseudolikelihood = -985.68636  

Fitting full model:

Iteration 0:   log pseudolikelihood = -985.68636  
Iteration 1:   log pseudolikelihood =   -929.728  
Iteration 2:   log pseudolikelihood = -896.73712  
Iteration 3:   log pseudolikelihood = -895.28011  
Iteration 4:   log pseudolikelihood = -895.27642  
Iteration 5:   log pseudolikelihood = -895.27642  

Log-logistic regression -- accelerated failure-time form 

No. of subjects      =          716                Number of obs   =      7018
No. of failures      =          555
Time at risk         =  6488.809199
                                                   Wald chi2(9)    =    205.11
Log pseudolikelihood =   -895.27642                Prob > chi2     =    0.0000

                       (standard errors adjusted for clustering on stsetpolid)
------------------------------------------------------------------------------
             |               Robust
          _t |  Tm. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 _Iourtype_2 |   1.850388   .1882415     6.05   0.000     1.515896    2.258688
 _Iourtype_3 |   3.613013   .5311381     8.74   0.000     2.708551    4.819501
     cgdpcap |   1.272844   .0562768     5.46   0.000     1.167188    1.388065
       gdpsq |   1.159579   .0330482     5.19   0.000     1.096582    1.226196
laggdpgrowth |   1.018423   .0082813     2.25   0.025     1.002321    1.034784
     avgnabo |   .3537809   .0889678    -4.13   0.000     .2161109    .5791514
    firstpol |    1.62368    .318865     2.47   0.014     1.104938    2.385959
  _Iperiod_4 |   .5826037   .1963841    -1.60   0.109     .3009194    1.127967
  _Iperiod_5 |   .5432538   .1793787    -1.85   0.065      .284408    1.037681
-------------+----------------------------------------------------------------
     /ln_gam |  -.4380912   .0395915   -11.07   0.000    -.5156891   -.3604933
-------------+----------------------------------------------------------------
       gamma |   .6452669   .0255471                       .597089    .6973323
------------------------------------------------------------------------------

. 
. /*   Model 3: Based on our definition of regime duration for the period 1950-1990      */
. 
. xi: streg i.ourtype cgdpcap gdpsq laggdpgr avgnabo firstpol i.period if app == 0 & ((year >=1950) & (year <=1990)), dist(llogistic) rob
> ust tr
i.ourtype         _Iourtype_0-3       (naturally coded; _Iourtype_0 omitted)
i.period          _Iperiod_1-5        (naturally coded; _Iperiod_1 omitted)

         failure _d:  status == 1
   analysis time _t:  (endnd-origin)/365.25
             origin:  time entrydate
                 id:  stsetpolid
note: _Iperiod_2 dropped due to collinearity
note: _Iperiod_3 dropped due to collinearity
note: _Iperiod_5 dropped due to collinearity

Fitting constant-only model:

Iteration 0:   log pseudolikelihood = -591.31958  
Iteration 1:   log pseudolikelihood = -581.29912  
Iteration 2:   log pseudolikelihood = -580.01126  
Iteration 3:   log pseudolikelihood = -580.00874  
Iteration 4:   log pseudolikelihood = -580.00874  

Fitting full model:

Iteration 0:   log pseudolikelihood = -580.00874  
Iteration 1:   log pseudolikelihood = -531.11781  
Iteration 2:   log pseudolikelihood = -520.40655  
Iteration 3:   log pseudolikelihood = -520.00388  
Iteration 4:   log pseudolikelihood = -520.00358  
Iteration 5:   log pseudolikelihood = -520.00358  

Log-logistic regression -- accelerated failure-time form 

No. of subjects      =          443                Number of obs   =      4337
No. of failures      =          313
Time at risk         =  4039.997043
                                                   Wald chi2(8)    =    155.11
Log pseudolikelihood =   -520.00358                Prob > chi2     =    0.0000

                       (standard errors adjusted for clustering on stsetpolid)
------------------------------------------------------------------------------
             |               Robust
          _t |  Tm. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 _Iourtype_2 |   2.269447   .3083459     6.03   0.000     1.738877    2.961907
 _Iourtype_3 |   4.368476   .8219553     7.84   0.000     3.021143    6.316678
     cgdpcap |   1.267552   .0667875     4.50   0.000     1.143183    1.405451
       gdpsq |   1.129722   .0399535     3.45   0.001     1.054067    1.210808
laggdpgrowth |    1.01027   .0124655     0.83   0.408     .9861307       1.035
     avgnabo |    .214454   .0704072    -4.69   0.000     .1126879    .4081232
    firstpol |   1.813918   .3939555     2.74   0.006     1.185085    2.776423
  _Iperiod_4 |   1.087666   .1694563     0.54   0.590     .8014566    1.476084
-------------+----------------------------------------------------------------
     /ln_gam |  -.4179521   .0525395    -7.96   0.000    -.5209276   -.3149766
-------------+----------------------------------------------------------------
       gamma |   .6583938   .0345917                      .5939693    .7298059
------------------------------------------------------------------------------

. 
. 
. /* Excluding caesaristic polities */
. /* xi: streg i.ourtype cgdpcap gdpsq laggdpgr avgnabo firstpol i.period if app == 0 & year >=1900 & xrec !=1, dist(llogistic) robust tr
>  */
. 
. /*   Model 4: Based on Przeworski et al. definition of regime duration      */
. 
. use "H:\papers\inst\AJPS\Institutions_AJPS_Rewrite_prz_final_RC1.dta", clear

. stset
-> stset endnd, id(dd_lagreg_id) failure(status==1) origin(time entrydate)
                scale(365.25)

                id:  dd_lagreg_id
     failure event:  status == 1
obs. time interval:  (endnd[_n-1], endnd]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time entrydate

------------------------------------------------------------------------------
     3956  total obs.
        0  exclusions
------------------------------------------------------------------------------
     3956  obs. remaining, representing
      203  subjects
       85  failures in single failure-per-subject data
 3866.316  total analysis time at risk, at risk from t =         0
                             earliest observed entry t =         0
                                  last observed exit t =   54.0561

. streg dd_lagreg cgdpcap gdpsq laggdpgr dd_absnabo dd_first if csip2 !=., dist(llogistic) robust tr

         failure _d:  status == 1
   analysis time _t:  (endnd-origin)/365.25
             origin:  time entrydate
                 id:  dd_lagreg_id

Fitting constant-only model:

Iteration 0:   log pseudolikelihood = -261.17775  
Iteration 1:   log pseudolikelihood = -238.60095  
Iteration 2:   log pseudolikelihood =  -238.4136  
Iteration 3:   log pseudolikelihood = -238.41175  
Iteration 4:   log pseudolikelihood = -238.41175  

Fitting full model:

Iteration 0:   log pseudolikelihood = -238.41175  (not concave)
Iteration 1:   log pseudolikelihood =  -213.4972  
Iteration 2:   log pseudolikelihood = -213.08712  
Iteration 3:   log pseudolikelihood = -213.08529  
Iteration 4:   log pseudolikelihood = -213.08529  

Log-logistic regression -- accelerated failure-time form 

No. of subjects      =          203                Number of obs   =      3751
No. of failures      =           69
Time at risk         =  3676.199535
                                                   Wald chi2(6)    =     34.03
Log pseudolikelihood =   -213.08529                Prob > chi2     =    0.0000

                     (standard errors adjusted for clustering on dd_lagreg_id)
------------------------------------------------------------------------------
             |               Robust
          _t |  Tm. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   dd_lagreg |   2.232178   1.100296     1.63   0.103      .849475     5.86553
     cgdpcap |   1.724401   .3518371     2.67   0.008     1.156016    2.572247
       gdpsq |   1.538068   .2341894     2.83   0.005     1.141222    2.072914
laggdpgrowth |   1.005907   .0459923     0.13   0.898     .9196844    1.100212
  dd_absnabo |   .0634759   .0519558    -3.37   0.001     .0127612    .3157381
 dd_firstpol |   7.398516   4.446295     3.33   0.001     2.278228    24.02659
-------------+----------------------------------------------------------------
     /ln_gam |   .3705922   .1817401     2.04   0.041     .0143882    .7267963
-------------+----------------------------------------------------------------
       gamma |   1.448592   .2632673                      1.014492    2.068443
------------------------------------------------------------------------------

. 
. 
. /*   Model 5: Based on Przeworski et al. definition of regime duration      */
. 
. streg dd_lagreg interact csip2 cgdpcap gdpsq laggdpgr dd_absnabo dd_first, dist(llogistic) robust tr

         failure _d:  status == 1
   analysis time _t:  (endnd-origin)/365.25
             origin:  time entrydate
                 id:  dd_lagreg_id

Fitting constant-only model:

Iteration 0:   log pseudolikelihood = -261.17775  
Iteration 1:   log pseudolikelihood = -238.60095  
Iteration 2:   log pseudolikelihood =  -238.4136  
Iteration 3:   log pseudolikelihood = -238.41175  
Iteration 4:   log pseudolikelihood = -238.41175  

Fitting full model:

Iteration 0:   log pseudolikelihood = -238.41175  (not concave)
Iteration 1:   log pseudolikelihood = -212.39035  
Iteration 2:   log pseudolikelihood = -209.78433  
Iteration 3:   log pseudolikelihood = -209.24744  
Iteration 4:   log pseudolikelihood = -209.24614  
Iteration 5:   log pseudolikelihood = -209.24614  

Log-logistic regression -- accelerated failure-time form 

No. of subjects      =          203                Number of obs   =      3751
No. of failures      =           69
Time at risk         =  3676.199535
                                                   Wald chi2(8)    =     32.93
Log pseudolikelihood =   -209.24614                Prob > chi2     =    0.0001

                     (standard errors adjusted for clustering on dd_lagreg_id)
------------------------------------------------------------------------------
             |               Robust
          _t |  Tm. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   dd_lagreg |   2.924494   2.269051     1.38   0.167     .6391784    13.38072
    interact |    .005847   .0136358    -2.20   0.027     .0000605    .5649814
       csip2 |   19.37619   34.23561     1.68   0.093     .6071385    618.3705
     cgdpcap |    1.52105    .327476     1.95   0.051      .997432    2.319551
       gdpsq |    1.40866   .1958657     2.46   0.014     1.072634    1.849953
laggdpgrowth |   1.012005   .0456706     0.26   0.791     .9263372    1.105596
  dd_absnabo |   .0812006   .0624912    -3.26   0.001     .0179673    .3669742
 dd_firstpol |   6.786373   4.142287     3.14   0.002     2.051534    22.44899
-------------+----------------------------------------------------------------
     /ln_gam |   .3380806   .1789696     1.89   0.059    -.0126933    .6888545
-------------+----------------------------------------------------------------
       gamma |   1.402254   .2509607                      .9873869    1.991433
------------------------------------------------------------------------------

. 
. /* Table 4. Log-logistic Regression Estimates of 
>    Polity Survival Time-Ratios, 1900-2000      
>                              */
. /* Model 6:*/
. 
. use "H:\papers\inst\AJPS\Institutions_AJPS_Rewrite_GHJS_final_RC1.dta", clear

. 
. stset endnd, id(stsetpolid) failure(status==1) origin(time entrydate) scale(365.25)

                id:  stsetpolid
     failure event:  status == 1
obs. time interval:  (endnd[_n-1], endnd]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time entrydate

------------------------------------------------------------------------------
    15597  total obs.
        0  exclusions
------------------------------------------------------------------------------
    15597  obs. remaining, representing
     1568  subjects
     1264  failures in single failure-per-subject data
 14221.17  total analysis time at risk, at risk from t =         0
                             earliest observed entry t =         0
                                  last observed exit t =  200.9966

. streg cpart cxconst cxconpart cgdpcap gdpsq laggdpgr avgnabo firstpol if xrec==4 & app==0 & year >=1900, dist(llogistic) robust tr

         failure _d:  status == 1
   analysis time _t:  (endnd-origin)/365.25
             origin:  time entrydate
                 id:  stsetpolid

Fitting constant-only model:

Iteration 0:   log pseudolikelihood = -315.71565  
Iteration 1:   log pseudolikelihood = -315.41844  
Iteration 2:   log pseudolikelihood = -315.41778  
Iteration 3:   log pseudolikelihood = -315.41778  

Fitting full model:

Iteration 0:   log pseudolikelihood = -315.41778  (not concave)
Iteration 1:   log pseudolikelihood = -271.05968  
Iteration 2:   log pseudolikelihood = -251.03112  
Iteration 3:   log pseudolikelihood = -247.98401  
Iteration 4:   log pseudolikelihood = -247.97646  
Iteration 5:   log pseudolikelihood = -247.97646  

Log-logistic regression -- accelerated failure-time form 

No. of subjects      =          218                Number of obs   =      3031
No. of failures      =          144
Time at risk         =  2886.845804
                                                   Wald chi2(8)    =    189.70
Log pseudolikelihood =   -247.97646                Prob > chi2     =    0.0000

                       (standard errors adjusted for clustering on stsetpolid)
------------------------------------------------------------------------------
             |               Robust
          _t |  Tm. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       cpart |   1.246472   .1388759     1.98   0.048      1.00195     1.55067
     cxconst |   .8836693   .0744857    -1.47   0.142     .7491017     1.04241
   cxconpart |   1.235154   .0610498     4.27   0.000     1.121111    1.360797
     cgdpcap |    1.30818   .1122385     3.13   0.002     1.105698    1.547742
       gdpsq |   1.160258   .0588648     2.93   0.003     1.050436    1.281562
laggdpgrowth |   1.015565    .023366     0.67   0.502     .9707862     1.06241
     avgnabo |   .4590861   .2188133    -1.63   0.102     .1803796    1.168425
    firstpol |   1.070951   .3719306     0.20   0.844     .5421954    2.115356
-------------+----------------------------------------------------------------
     /ln_gam |  -.4369888   .0653393    -6.69   0.000    -.5650515   -.3089261
-------------+----------------------------------------------------------------
       gamma |   .6459787   .0422078                      .5683309     .734235
------------------------------------------------------------------------------

. 
. /* Model 7:*/ 
. 
. streg cpart cxconst dual cxconpart partdual cgdpcap  gdpsq laggdpgr avgnabo firstpol if xrec!=4 & app==0 & year >=1900, dist(llogistic)
>  robust tr

         failure _d:  status == 1
   analysis time _t:  (endnd-origin)/365.25
             origin:  time entrydate
                 id:  stsetpolid

Fitting constant-only model:

Iteration 0:   log pseudolikelihood = -708.82983  
Iteration 1:   log pseudolikelihood = -703.26453  
Iteration 2:   log pseudolikelihood =  -661.3557  
Iteration 3:   log pseudolikelihood = -661.01931  
Iteration 4:   log pseudolikelihood = -661.01904  
Iteration 5:   log pseudolikelihood = -661.01904  

Fitting full model:

Iteration 0:   log pseudolikelihood = -661.01904  
Iteration 1:   log pseudolikelihood = -643.17441  
Iteration 2:   log pseudolikelihood = -629.35893  
Iteration 3:   log pseudolikelihood = -628.94569  
Iteration 4:   log pseudolikelihood = -628.94517  
Iteration 5:   log pseudolikelihood = -628.94517  

Log-logistic regression -- accelerated failure-time form 

No. of subjects      =          498                Number of obs   =      4072
No. of failures      =          412
Time at risk         =  3684.922902
                                                   Wald chi2(10)   =     85.28
Log pseudolikelihood =   -628.94517                Prob > chi2     =    0.0000

                       (standard errors adjusted for clustering on stsetpolid)
------------------------------------------------------------------------------
             |               Robust
          _t |  Tm. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       cpart |   .8787489   .0584691    -1.94   0.052     .7713094    1.001154
     cxconst |   .9376071   .0433489    -1.39   0.163     .8563806    1.026538
        dual |   .8450731   .1486898    -0.96   0.339     .5985855     1.19306
   cxconpart |   1.057964   .0297125     2.01   0.045     1.001303    1.117832
    partdual |   1.246943   .1382088     1.99   0.046     1.003462    1.549502
     cgdpcap |   1.135596   .0622096     2.32   0.020     1.019985    1.264311
       gdpsq |   1.085585   .0385711     2.31   0.021     1.012559    1.163878
laggdpgrowth |   1.019373   .0084413     2.32   0.020     1.002962    1.036052
     avgnabo |   .5205262    .149981    -2.27   0.023     .2959259    .9155924
    firstpol |   2.042018   .4017803     3.63   0.000     1.388609    3.002887
-------------+----------------------------------------------------------------
     /ln_gam |  -.4800869   .0472686   -10.16   0.000    -.5727317   -.3874422
-------------+----------------------------------------------------------------
       gamma |   .6187296   .0292465                      .5639827    .6787909
------------------------------------------------------------------------------

. 
. /* Excluding  caesaristic polities */
. streg cpart cxconst dual cxconpart partdual cgdpcap  gdpsq laggdpgr avgnabo firstpol if xrec!=4 & xrec !=1 & app==0 & year >=1900, dist
> (llogistic) robust tr

         failure _d:  status == 1
   analysis time _t:  (endnd-origin)/365.25
             origin:  time entrydate
                 id:  stsetpolid

Fitting constant-only model:

Iteration 0:   log pseudolikelihood = -559.38663  
Iteration 1:   log pseudolikelihood = -551.42609  
Iteration 2:   log pseudolikelihood = -524.07935  
Iteration 3:   log pseudolikelihood =  -523.8132  
Iteration 4:   log pseudolikelihood = -523.81301  
Iteration 5:   log pseudolikelihood = -523.81301  

Fitting full model:

Iteration 0:   log pseudolikelihood = -523.81301  
Iteration 1:   log pseudolikelihood = -520.39675  
Iteration 2:   log pseudolikelihood = -498.14909  
Iteration 3:   log pseudolikelihood = -495.96118  
Iteration 4:   log pseudolikelihood = -495.95563  
Iteration 5:   log pseudolikelihood = -495.95563  

Log-logistic regression -- accelerated failure-time form 

No. of subjects      =          399                Number of obs   =      3291
No. of failures      =          327
Time at risk         =  2988.030171
                                                   Wald chi2(10)   =     77.95
Log pseudolikelihood =   -495.95563                Prob > chi2     =    0.0000

                       (standard errors adjusted for clustering on stsetpolid)
------------------------------------------------------------------------------
             |               Robust
          _t |  Tm. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       cpart |   .8363523   .0591938    -2.52   0.012      .728022    .9608023
     cxconst |   .9162329   .0454158    -1.76   0.078     .8314068    1.009714
        dual |   .7905286   .1377298    -1.35   0.177     .5618456     1.11229
   cxconpart |   1.070226   .0322754     2.25   0.024       1.0088    1.135391
    partdual |   1.307512   .1477358     2.37   0.018     1.047776    1.631635
     cgdpcap |   1.119991   .0643962     1.97   0.049     1.000629    1.253592
       gdpsq |   1.095412   .0416675     2.40   0.017     1.016715      1.1802
laggdpgrowth |   1.017544   .0093288     1.90   0.058     .9994229    1.035993
     avgnabo |   .6974323   .2499169    -1.01   0.315     .3455283    1.407733
    firstpol |   1.764965   .3585267     2.80   0.005     1.185297     2.62812
-------------+----------------------------------------------------------------
     /ln_gam |    -.47777   .0567301    -8.42   0.000    -.5889589   -.3665812
-------------+----------------------------------------------------------------
       gamma |   .6201648    .035182                      .5549047    .6930999
------------------------------------------------------------------------------

. 
. 
. /* Table 5. Estimated Survival Times Relative to Baseline for                   */
. /*   Polities with Open and Competitive Executive Recruitment, 1900-2000      */
. 
. stci if app==0 & xrec==4

         failure _d:  status == 1
   analysis time _t:  (endnd-origin)/365.25
             origin:  time entrydate
                 id:  stsetpolid

             |    no. of 
             |  subjects         50%     Std. Err.     [95% Conf. Interval]
-------------+-------------------------------------------------------------
       total |       316    7.310034      .4763009      5.52769    9.49484

. replace xrec=4 if app==1
(144 real changes made)

. 
. /* Model 6 reestimated to predict for appendix data */
. /* Reestimating to include app observations */
. 
. capture drop m5pred

. streg cpart cxconst cxconpart cgdpcap gdpsq laggdpgr avgnabo firstpol if xrec==4 & app==0 & year >=1900, dist(llogistic) robust tr

         failure _d:  status == 1
   analysis time _t:  (endnd-origin)/365.25
             origin:  time entrydate
                 id:  stsetpolid

Fitting constant-only model:

Iteration 0:   log pseudolikelihood = -315.71565  
Iteration 1:   log pseudolikelihood = -315.41844  
Iteration 2:   log pseudolikelihood = -315.41778  
Iteration 3:   log pseudolikelihood = -315.41778  

Fitting full model:

Iteration 0:   log pseudolikelihood = -315.41778  (not concave)
Iteration 1:   log pseudolikelihood = -271.05968  
Iteration 2:   log pseudolikelihood = -251.03112  
Iteration 3:   log pseudolikelihood = -247.98401  
Iteration 4:   log pseudolikelihood = -247.97646  
Iteration 5:   log pseudolikelihood = -247.97646  

Log-logistic regression -- accelerated failure-time form 

No. of subjects      =          218                Number of obs   =      3031
No. of failures      =          144
Time at risk         =  2886.845804
                                                   Wald chi2(8)    =    189.70
Log pseudolikelihood =   -247.97646                Prob > chi2     =    0.0000

                       (standard errors adjusted for clustering on stsetpolid)
------------------------------------------------------------------------------
             |               Robust
          _t |  Tm. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       cpart |   1.246472   .1388759     1.98   0.048      1.00195     1.55067
     cxconst |   .8836693   .0744857    -1.47   0.142     .7491017     1.04241
   cxconpart |   1.235154   .0610498     4.27   0.000     1.121111    1.360797
     cgdpcap |    1.30818   .1122385     3.13   0.002     1.105698    1.547742
       gdpsq |   1.160258   .0588648     2.93   0.003     1.050436    1.281562
laggdpgrowth |   1.015565    .023366     0.67   0.502     .9707862     1.06241
     avgnabo |   .4590861   .2188133    -1.63   0.102     .1803796    1.168425
    firstpol |   1.070951   .3719306     0.20   0.844     .5421954    2.115356
-------------+----------------------------------------------------------------
     /ln_gam |  -.4369888   .0653393    -6.69   0.000    -.5650515   -.3089261
-------------+----------------------------------------------------------------
       gamma |   .6459787   .0422078                      .5683309     .734235
------------------------------------------------------------------------------

. predict m5pred, median time 
(8350 missing values generated)

. 
. 
. /* Calculating cell counts for Table 5*/
. /*capture drop cons4
> gen cons4 = xconst*/
. replace cons4 = xconst if app==0
(14358 real changes made)

. recode cons4 2/3=2 4/5=3 6/7=4 if app==0
(cons4: 9144 changes made)

. /*capture drop part4
> gen part4 = 0 if part ~=.*/
. replace part4 = 0 if part ~=. & app==0
(15453 real changes made)

. recode part4 0=1 if part > 0 & exp(part)<=7 & app==0
(part4: 2766 changes made)

. recode part4 0=2 if exp(part)>7 & exp(part)<=30 & app==0
(part4: 2398 changes made)

. recode part4 0=3 if exp(part)>30 & app==0
(part4: 2586 changes made)

. 
. /* Tabulating for all polities with data, obtaining cell counts */
. tabulate part4 cons4 if orig== 1 & xrec==4 & cgdpcap ~=. & avgnabo ~=. & firstpol~=. & app == 0

           |                    cons4
     part4 |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |         1          8          3          9 |        21 
         1 |         0          2          2          5 |         9 
         2 |         0         13         14         39 |        66 
         3 |         0          6         19         44 |        69 
-----------+--------------------------------------------+----------
     Total |         1         29         38         97 |       165 


. 
. table part4 cons4 if app==1, c(mean m5pred)

--------------------------------------------------
          |                 cons4                 
    part4 |        1         2         3         4
----------+---------------------------------------
        1 | 8.863762  4.013816  1.817594   .823069
        2 | 5.133495  4.587778  4.100074  3.664215
        3 | 4.057565  4.859576  5.820111  6.970504
        4 | 2.350024  5.554442   13.1283  31.02964
--------------------------------------------------

. 
. 
. /* Table 6a. Estimated Median Survival Times for Polities 
>    with Designated or Ascribed Executive: 1900-2000                         */
. 
. 
. stci if app==0 & xrec~=4

         failure _d:  status == 1
   analysis time _t:  (endnd-origin)/365.25
             origin:  time entrydate
                 id:  stsetpolid

             |    no. of 
             |  subjects         50%     Std. Err.     [95% Conf. Interval]
-------------+-------------------------------------------------------------
       total |      1108    4.317563      .1342929      3.99997    4.61051

. 
. replace xrec=1 if app==1
(144 real changes made)

. 
. /* Model 7 reestimated to predict for appendix data */
. /* INCLUDING CAESARISTIC POLITIES */
. 
. capture drop m6pred

. streg cpart cxconst dual cxconpart partdual cgdpcap  gdpsq laggdpgr avgnabo firstpol if xrec!=4  & app==0 & year >=1900, dist(llogistic
> ) robust tr

         failure _d:  status == 1
   analysis time _t:  (endnd-origin)/365.25
             origin:  time entrydate
                 id:  stsetpolid

Fitting constant-only model:

Iteration 0:   log pseudolikelihood = -708.82983  
Iteration 1:   log pseudolikelihood = -703.26453  
Iteration 2:   log pseudolikelihood =  -661.3557  
Iteration 3:   log pseudolikelihood = -661.01931  
Iteration 4:   log pseudolikelihood = -661.01904  
Iteration 5:   log pseudolikelihood = -661.01904  

Fitting full model:

Iteration 0:   log pseudolikelihood = -661.01904  
Iteration 1:   log pseudolikelihood = -643.17441  
Iteration 2:   log pseudolikelihood = -629.35893  
Iteration 3:   log pseudolikelihood = -628.94569  
Iteration 4:   log pseudolikelihood = -628.94517  
Iteration 5:   log pseudolikelihood = -628.94517  

Log-logistic regression -- accelerated failure-time form 

No. of subjects      =          498                Number of obs   =      4072
No. of failures      =          412
Time at risk         =  3684.922902
                                                   Wald chi2(10)   =     85.28
Log pseudolikelihood =   -628.94517                Prob > chi2     =    0.0000

                       (standard errors adjusted for clustering on stsetpolid)
------------------------------------------------------------------------------
             |               Robust
          _t |  Tm. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       cpart |   .8787489   .0584691    -1.94   0.052     .7713094    1.001154
     cxconst |   .9376071   .0433489    -1.39   0.163     .8563806    1.026538
        dual |   .8450731   .1486898    -0.96   0.339     .5985855     1.19306
   cxconpart |   1.057964   .0297125     2.01   0.045     1.001303    1.117832
    partdual |   1.246943   .1382088     1.99   0.046     1.003462    1.549502
     cgdpcap |   1.135596   .0622096     2.32   0.020     1.019985    1.264311
       gdpsq |   1.085585   .0385711     2.31   0.021     1.012559    1.163878
laggdpgrowth |   1.019373   .0084413     2.32   0.020     1.002962    1.036052
     avgnabo |   .5205262    .149981    -2.27   0.023     .2959259    .9155924
    firstpol |   2.042018   .4017803     3.63   0.000     1.388609    3.002887
-------------+----------------------------------------------------------------
     /ln_gam |  -.4800869   .0472686   -10.16   0.000    -.5727317   -.3874422
-------------+----------------------------------------------------------------
       gamma |   .6187296   .0292465                      .5639827    .6787909
------------------------------------------------------------------------------

. predict m6pred, median time 
(8350 missing values generated)

. 
. 
. 
. /* Calculating cell counts for Table 6a: designated executifve */
. /* Tabulating for all polities with data, obtaining cell counts */
. tabulate part4 cons4 if orig== 1 & xrec~=4 & dual==0 & cgdpcap ~=. & avgnabo ~=. & firstpol~=. & app == 0

           |                    cons4
     part4 |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |        86         52          2          2 |       142 
         1 |        19         46          1          1 |        67 
         2 |        17         37          4          0 |        58 
         3 |         3         16          2          0 |        21 
-----------+--------------------------------------------+----------
     Total |       125        151          9          3 |       288 


. 
. table part4 cons4 if app==1 & dual==0 , c(mean m6pred)

--------------------------------------------------
          |                 cons4                 
    part4 |        1         2         3         4
----------+---------------------------------------
        1 |  10.1203  7.693073  5.847986   4.44542
        2 | 6.463541   5.89046  5.368191  4.892228
        3 | 5.328646  5.250702  5.173898  5.098217
        4 | 3.403327   4.02043  4.749428   5.61061
--------------------------------------------------

. 
. 
. /* Table 6b. Estimated Median Survival Times for 
>    Polities with Dual Executive: 1900-2000                                  */
. 
. /* Calculating cell counts for Table 6b: dual*/
. /* Tabulating for all polities with data, obtaining cell counts */
. 
. tabulate part4 cons4 if orig== 1 & xrec~=4 & dual == 1 & cgdpcap ~=. & avgnabo ~=. &firstpol~=. & app == 0

           |                    cons4
     part4 |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |         6          9          5          4 |        24 
         1 |         1         14          3          5 |        23 
         2 |         0         24         19          9 |        52 
         3 |         0          6          5         13 |        24 
-----------+--------------------------------------------+----------
     Total |         7         53         32         31 |       123 


. 
. table part4 cons4 if app==1 & dual == 1, c(mean m6pred)

--------------------------------------------------
          |                 cons4                 
    part4 |        1         2         3         4
----------+---------------------------------------
        1 | 6.433477  4.890489  3.717566  2.825955
        2 | 5.861216   5.34154  4.867939  4.436331
        3 | 5.630737  5.548374  5.467216  5.387244
        4 | 5.129904  6.060076  7.158909  8.456987
--------------------------------------------------

. 
. /* Table 6b. Estimated Median Survival Times for 
>    Polities with Dual Executive: 1900-2000                                  */
. 
. /* Calculating cell counts for Table 6b: dual*/
. /* Tabulating for all polities with data, obtaining cell counts */
. 
. tabulate part4 cons4 if orig== 1 & xrec~=4 & cgdpcap ~=. & avgnabo ~=. &firstpol~=. & app == 0

           |                    cons4
     part4 |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |        92         61          7          6 |       166 
         1 |        20         60          4          6 |        90 
         2 |        17         61         23          9 |       110 
         3 |         3         22          7         13 |        45 
-----------+--------------------------------------------+----------
     Total |       132        204         41         34 |       411 


. 
. table part4 cons4 if app==1, c(mean m6pred)

--------------------------------------------------
          |                 cons4                 
    part4 |        1         2         3         4
----------+---------------------------------------
        1 | 8.891359  6.758878  5.137846  3.905598
        2 | 6.262766  5.707487  5.201441  4.740263
        3 | 5.429343  5.349926   5.27167  5.194559
        4 | 3.978853  4.700312  5.552588  6.559402
--------------------------------------------------

. 
end of do-file

