{smcl}
{com}{sf}{ul off}{txt}{.-}
       log:  {res}C:\Users\mattesmc\Documents\Papers\Civil Wars\Civil War I\ISQ\R&R\R&R2\ISQrep.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}13 Nov 2008, 14:44:57
{txt}
{com}. do "C:\Users\mattesmc\AppData\Local\Temp\STD0b000000.tmp"
{txt}
{com}. ***Descriptive statistics
. *polpssum= repex + repcs + repleg
. tab polpssum

      {txt}(max) {c |}
    polpsHH {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         12       26.09       26.09
{txt}          1 {c |}{res}         10       21.74       47.83
{txt}          2 {c |}{res}         10       21.74       69.57
{txt}          3 {c |}{res}         14       30.43      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         46      100.00
{txt}
{com}. *milpssum= milldr + milint
. tab milpssum

      {txt}(max) {c |}
     milps2 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         17       36.96       36.96
{txt}          1 {c |}{res}         22       47.83       84.78
{txt}          2 {c |}{res}          7       15.22      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         46      100.00
{txt}
{com}. *econpssum= landredist + otherredist
. tab econpssum

      {txt}(max) {c |}
    econps2 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         30       65.22       65.22
{txt}          1 {c |}{res}         13       28.26       93.48
{txt}          2 {c |}{res}          3        6.52      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         46      100.00
{txt}
{com}. *terrpssum= autonomy + federalism
. tab terrpssum

      {txt}(max) {c |}
    terrps2 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         30       65.22       65.22
{txt}          1 {c |}{res}         16       34.78      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         46      100.00
{txt}
{com}. 
. tab guarantee

      {txt}(max) {c |}
newguarante {c |}
     edummy {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         32       69.57       69.57
{txt}          1 {c |}{res}         14       30.43      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         46      100.00
{txt}
{com}. tab costinc

      {txt}(max) {c |}
     cost11 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}          8       17.39       17.39
{txt}          1 {c |}{res}         15       32.61       50.00
{txt}          2 {c |}{res}         15       32.61       82.61
{txt}          3 {c |}{res}          6       13.04       95.65
{txt}          4 {c |}{res}          2        4.35      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         46      100.00
{txt}
{com}. tab issue

{txt}(max) issue {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}          9       19.57       19.57
{txt}          1 {c |}{res}         12       26.09       45.65
{txt}          2 {c |}{res}         25       54.35      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         46      100.00
{txt}
{com}. sum duration

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
    duration {c |}{res}        46    1.623696    .5553552        .48       2.61
{txt}
{com}. sum costs

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
       costs {c |}{res}        46   -.4921739    1.225929       -2.5       1.82
{txt}
{com}. tab peacefail

      {txt}(max) {c |}
  peacefail {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         28       60.87       60.87
{txt}          1 {c |}{res}         18       39.13      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         46      100.00
{txt}
{com}. sum peacedur

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
    peacedur {c |}{res}        46    107.8261      97.781          2        489
{txt}
{com}. 
. **Endogeneity Tests
. oprobit costinc issue costs duration, robust cluster (ccode)

{txt}Iteration 0:   log pseudolikelihood = {res}-66.103615
{txt}Iteration 1:   log pseudolikelihood = {res}-65.884221
{txt}Iteration 2:   log pseudolikelihood = {res}-65.884217

{txt}Ordered probit regression{col 51}Number of obs{col 67}= {res}        46
{txt}{col 51}Wald chi2({res}3{txt}){col 67}= {res}      0.42
{txt}{col 51}Prob > chi2{col 67}= {res}    0.9371
{txt}Log pseudolikelihood = {res}-65.884217{txt}{col 51}Pseudo R2{col 67}= {res}    0.0033

{txt}{ralign 78:(Std. Err. adjusted for {res:32} clusters in ccode)}
{col 1}{text}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 14}{text}{c |}{col 26}    Robust
{col 1}{text}     costinc{col 14}{c |}      Coef.{col 26}   Std. Err.{col 37}      z{col 46}   P>|z|{col 55}    [95% Conf. Interval]
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}       issue{col 14}{c |}{result}{space 2}-.0431593{col 26}{space 2} .2058775{col 37}{space 1}   -0.21{col 46}{space 3}0.834{col 55}{space 3}-.4466718{col 67}{space 3} .3603533
{col 1}{text}       costs{col 14}{c |}{result}{space 2}   .04546{col 26}{space 2} .1625118{col 37}{space 1}    0.28{col 46}{space 3}0.780{col 55}{space 3}-.2730573{col 67}{space 3} .3639773
{col 1}{text}    duration{col 14}{c |}{result}{space 2}-.1535641{col 26}{space 2}  .291196{col 37}{space 1}   -0.53{col 46}{space 3}0.598{col 55}{space 3}-.7242978{col 67}{space 3} .4171697
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}       /cut1{col 14}{c |}{result}{space 2}-1.272391{col 27}{space 1} .5626298{col 55}{space 3}-2.375125{col 67}{space 3}-.1696568
{col 1}{text}       /cut2{col 14}{c |}{result}{space 2}-.3296503{col 27}{space 1} .5897784{col 55}{space 3}-1.485595{col 67}{space 3} .8262941
{col 1}{text}       /cut3{col 14}{c |}{result}{space 2} .6108704{col 27}{space 1} .5817562{col 55}{space 3}-.5293507{col 67}{space 3} 1.751092
{col 1}{text}       /cut4{col 14}{c |}{result}{space 2} 1.392529{col 27}{space 1} .7080382{col 55}{space 3} .0047999{col 67}{space 3} 2.780259
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}

{com}. oprobit polpssum issue costs duration, robust cluster (ccode)

{txt}Iteration 0:   log pseudolikelihood = {res} -63.30012
{txt}Iteration 1:   log pseudolikelihood = {res}-63.117882
{txt}Iteration 2:   log pseudolikelihood = {res} -63.11788

{txt}Ordered probit regression{col 51}Number of obs{col 67}= {res}        46
{txt}{col 51}Wald chi2({res}3{txt}){col 67}= {res}      0.36
{txt}{col 51}Prob > chi2{col 67}= {res}    0.9474
{txt}Log pseudolikelihood = {res} -63.11788{txt}{col 51}Pseudo R2{col 67}= {res}    0.0029

{txt}{ralign 78:(Std. Err. adjusted for {res:32} clusters in ccode)}
{col 1}{text}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 14}{text}{c |}{col 26}    Robust
{col 1}{text}    polpssum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 37}      z{col 46}   P>|z|{col 55}    [95% Conf. Interval]
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}       issue{col 14}{c |}{result}{space 2}-.0116677{col 26}{space 2} .2033882{col 37}{space 1}   -0.06{col 46}{space 3}0.954{col 55}{space 3}-.4103013{col 67}{space 3} .3869658
{col 1}{text}       costs{col 14}{c |}{result}{space 2} .0328283{col 26}{space 2} .1191272{col 37}{space 1}    0.28{col 46}{space 3}0.783{col 55}{space 3}-.2006568{col 67}{space 3} .2663134
{col 1}{text}    duration{col 14}{c |}{result}{space 2} .1606015{col 26}{space 2} .3345303{col 37}{space 1}    0.48{col 46}{space 3}0.631{col 55}{space 3}-.4950658{col 67}{space 3} .8162688
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}       /cut1{col 14}{c |}{result}{space 2}-.4113688{col 27}{space 1} .7247745{col 55}{space 3}-1.831901{col 67}{space 3} 1.009163
{col 1}{text}       /cut2{col 14}{c |}{result}{space 2}  .180189{col 27}{space 1} .7172821{col 55}{space 3}-1.225658{col 67}{space 3} 1.586036
{col 1}{text}       /cut3{col 14}{c |}{result}{space 2}  .744136{col 27}{space 1} .7325538{col 55}{space 3} -.691643{col 67}{space 3} 2.179915
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}

{com}. oprobit econpssum issue costs duration, robust cluster (ccode)

{txt}Iteration 0:   log pseudolikelihood = {res}-37.441404
{txt}Iteration 1:   log pseudolikelihood = {res}-34.648676
{txt}Iteration 2:   log pseudolikelihood = {res}-34.627984
{txt}Iteration 3:   log pseudolikelihood = {res}-34.627979

{txt}Ordered probit regression{col 51}Number of obs{col 67}= {res}        46
{txt}{col 51}Wald chi2({res}3{txt}){col 67}= {res}      5.53
{txt}{col 51}Prob > chi2{col 67}= {res}    0.1370
{txt}Log pseudolikelihood = {res}-34.627979{txt}{col 51}Pseudo R2{col 67}= {res}    0.0751

{txt}{ralign 78:(Std. Err. adjusted for {res:32} clusters in ccode)}
{col 1}{text}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 14}{text}{c |}{col 26}    Robust
{col 1}{text}   econpssum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 37}      z{col 46}   P>|z|{col 55}    [95% Conf. Interval]
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}       issue{col 14}{c |}{result}{space 2} .0165735{col 26}{space 2} .2445219{col 37}{space 1}    0.07{col 46}{space 3}0.946{col 55}{space 3}-.4626806{col 67}{space 3} .4958275
{col 1}{text}       costs{col 14}{c |}{result}{space 2}-.2237571{col 26}{space 2} .1434797{col 37}{space 1}   -1.56{col 46}{space 3}0.119{col 55}{space 3}-.5049722{col 67}{space 3}  .057458
{col 1}{text}    duration{col 14}{c |}{result}{space 2} .6830563{col 26}{space 2} .3953978{col 37}{space 1}    1.73{col 46}{space 3}0.084{col 55}{space 3}-.0919091{col 67}{space 3} 1.458022
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}       /cut1{col 14}{c |}{result}{space 2} 1.671859{col 27}{space 1}  .786211{col 55}{space 3} .1309135{col 67}{space 3} 3.212804
{col 1}{text}       /cut2{col 14}{c |}{result}{space 2} 2.909007{col 27}{space 1} .7820824{col 55}{space 3} 1.376154{col 67}{space 3}  4.44186
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}

{com}. probit terrpssum issue costs duration, robust cluster (ccode)

{txt}Iteration 0:   log pseudolikelihood = {res}-29.720163
{txt}Iteration 1:   log pseudolikelihood = {res}-24.504131
{txt}Iteration 2:   log pseudolikelihood = {res}-24.379557
{txt}Iteration 3:   log pseudolikelihood = {res}-24.379226

{txt}Probit regression                                 Number of obs   = {res}        46
                                                  {txt}Wald chi2({res}3{txt})    = {res}     11.40
                                                  {txt}Prob > chi2     = {res}    0.0098
{txt}Log pseudolikelihood = {res}-24.379226                 {txt}Pseudo R2       = {res}    0.1797

                                 {txt}(Std. Err. adjusted for {res}32{txt} clusters in ccode)
{hline 13}{c TT}{hline 64}
             {c |}               Robust
   terrpssum {c |}      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
{hline 13}{c +}{hline 64}
       issue {c |}  {res} .6884925   .3299771     2.09   0.037     .0417493    1.335236
       {txt}costs {c |}  {res}-.1954564   .1701931    -1.15   0.251    -.5290287     .138116
    {txt}duration {c |}  {res} .8019943   .3946795     2.03   0.042     .0284367    1.575552
       {txt}_cons {c |}  {res}-2.822275   .8896518    -3.17   0.002    -4.565961    -1.07859
{txt}{hline 13}{c BT}{hline 64}

{com}. oprobit milpssum issue costs duration, robust cluster (ccode)

{txt}Iteration 0:   log pseudolikelihood = {res}-46.328572
{txt}Iteration 1:   log pseudolikelihood = {res}-44.686097
{txt}Iteration 2:   log pseudolikelihood = {res}-44.684294
{txt}Iteration 3:   log pseudolikelihood = {res}-44.684294

{txt}Ordered probit regression{col 51}Number of obs{col 67}= {res}        46
{txt}{col 51}Wald chi2({res}3{txt}){col 67}= {res}      3.62
{txt}{col 51}Prob > chi2{col 67}= {res}    0.3060
{txt}Log pseudolikelihood = {res}-44.684294{txt}{col 51}Pseudo R2{col 67}= {res}    0.0355

{txt}{ralign 78:(Std. Err. adjusted for {res:32} clusters in ccode)}
{col 1}{text}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 14}{text}{c |}{col 26}    Robust
{col 1}{text}    milpssum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 37}      z{col 46}   P>|z|{col 55}    [95% Conf. Interval]
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}       issue{col 14}{c |}{result}{space 2}   .24808{col 26}{space 2} .2064857{col 37}{space 1}    1.20{col 46}{space 3}0.230{col 55}{space 3}-.1566245{col 67}{space 3} .6527844
{col 1}{text}       costs{col 14}{c |}{result}{space 2}-.0014829{col 26}{space 2} .1271618{col 37}{space 1}   -0.01{col 46}{space 3}0.991{col 55}{space 3}-.2507155{col 67}{space 3} .2477497
{col 1}{text}    duration{col 14}{c |}{result}{space 2} .4896875{col 26}{space 2} .3472236{col 37}{space 1}    1.41{col 46}{space 3}0.158{col 55}{space 3}-.1908583{col 67}{space 3} 1.170233
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}       /cut1{col 14}{c |}{result}{space 2} .7810235{col 27}{space 1} .6680594{col 55}{space 3}-.5283489{col 67}{space 3} 2.090396
{col 1}{text}       /cut2{col 14}{c |}{result}{space 2} 2.207083{col 27}{space 1} .6881536{col 55}{space 3} .8583264{col 67}{space 3} 3.555839
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}

{com}. probit guarantee issue costs duration, robust cluster (ccode)

{txt}Iteration 0:   log pseudolikelihood = {res}-28.267153
{txt}Iteration 1:   log pseudolikelihood = {res}-26.475522
{txt}Iteration 2:   log pseudolikelihood = {res}-26.464183
{txt}Iteration 3:   log pseudolikelihood = {res}-26.464181

{txt}Probit regression                                 Number of obs   = {res}        46
                                                  {txt}Wald chi2({res}3{txt})    = {res}      4.42
                                                  {txt}Prob > chi2     = {res}    0.2198
{txt}Log pseudolikelihood = {res}-26.464181                 {txt}Pseudo R2       = {res}    0.0638

                                 {txt}(Std. Err. adjusted for {res}32{txt} clusters in ccode)
{hline 13}{c TT}{hline 64}
             {c |}               Robust
   guarantee {c |}      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
{hline 13}{c +}{hline 64}
       issue {c |}  {res}-.1236521   .2640474    -0.47   0.640    -.6411754    .3938712
       {txt}costs {c |}  {res} .2013496   .1611929     1.25   0.212    -.1145826    .5172818
    {txt}duration {c |}  {res}-.5342325   .3533739    -1.51   0.131    -1.226833    .1583675
       {txt}_cons {c |}  {res} .5814875   .7238118     0.80   0.422    -.8371576    2.000133
{txt}{hline 13}{c BT}{hline 64}

{com}. 
. ***Preparing data for duration analysis
. stset peacedur, id(idnumber) failure(peacefail)

                {txt}id:  {res}idnumber
     {txt}failure event:  {res}peacefail != 0 & peacefail < .
{txt}obs. time interval:  {res}(peacedur[_n-1], peacedur]
{txt} exit on or before:  {res}failure

{txt}{hline 78}
{res}       46{txt}  total obs.
{res}        0{txt}  exclusions
{hline 78}
{res}       46{txt}  obs. remaining, representing
{res}       46{txt}  subjects
{res}       18{txt}  failures in single failure-per-subject data
{res}     4960{txt}  total analysis time at risk, at risk from t = {res}        0
                             {txt}earliest observed entry t = {res}        0
                                  {txt}last observed exit t = {res}      489
{txt}
{com}. 
. **Main Model
. 
. stcox polpssum milpssum econpssum terrpssum costinc guarantee issue costs duration, efron cluster(ccode) 

         {txt}failure _d:  {res}peacefail
   {txt}analysis time _t:  {res}peacedur
                 {txt}id:  {res}idnumber

{txt}Iteration 0:   log pseudolikelihood = {res}-59.247769
{txt}Iteration 1:   log pseudolikelihood = {res}-48.798652
{txt}Iteration 2:   log pseudolikelihood = {res}-47.596788
{txt}Iteration 3:   log pseudolikelihood = {res}-47.504673
{txt}Iteration 4:   log pseudolikelihood = {res}-47.504422
{txt}Refining estimates:
Iteration 0:   log pseudolikelihood = {res}-47.504422

{txt}Cox regression -- Efron method for ties

No. of subjects      = {res}          46                {txt}Number of obs   ={res}        46
{txt}No. of failures      = {res}          18
{txt}Time at risk         = {res}        4960
                                                   {txt}Wald chi2({res}9{txt})    ={res}     28.39
{txt}Log pseudolikelihood =   {res}-47.504422                {txt}Prob > chi2     ={res}    0.0008

                                 {txt}(Std. Err. adjusted for {res}32{txt} clusters in ccode)
{hline 13}{c TT}{hline 64}
             {c |}               Robust
          _t {c |} Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
{hline 13}{c +}{hline 64}
    polpssum {c |}  {res} .7079096   .1411207    -1.73   0.083      .478952    1.046318
    {txt}milpssum {c |}  {res} 1.296435   .5702963     0.59   0.555     .5474075     3.07037
   {txt}econpssum {c |}  {res} 1.761464   .8205759     1.22   0.224     .7068751    4.389399
   {txt}terrpssum {c |}  {res} .3233559    .289975    -1.26   0.208     .0557636     1.87504
     {txt}costinc {c |}  {res} .6100431   .1034806    -2.91   0.004     .4374945    .8506452
   {txt}guarantee {c |}  {res} .3118761   .2101564    -1.73   0.084     .0832537    1.168317
       {txt}issue {c |}  {res} 2.965823   1.225051     2.63   0.008     1.319931    6.664063
       {txt}costs {c |}  {res} 1.445252   .3127655     1.70   0.089     .9456624    2.208774
    {txt}duration {c |}  {res} 1.166176   .9703434     0.18   0.853     .2282981    5.956976
{txt}{hline 13}{c BT}{hline 64}

{com}. 
. **Baseline Hazard
. stcox polpssum milpssum econpssum terrpssum costinc guarantee issue costs duration, efron cluster(ccode) nohr basehc(hazard)

         {txt}failure _d:  {res}peacefail
   {txt}analysis time _t:  {res}peacedur
                 {txt}id:  {res}idnumber

{txt}Iteration 0:   log pseudolikelihood = {res}-59.247769
{txt}Iteration 1:   log pseudolikelihood = {res}-48.798652
{txt}Iteration 2:   log pseudolikelihood = {res}-47.596788
{txt}Iteration 3:   log pseudolikelihood = {res}-47.504673
{txt}Iteration 4:   log pseudolikelihood = {res}-47.504422
{txt}Refining estimates:
Iteration 0:   log pseudolikelihood = {res}-47.504422

{txt}Cox regression -- Efron method for ties

No. of subjects      = {res}          46                {txt}Number of obs   ={res}        46
{txt}No. of failures      = {res}          18
{txt}Time at risk         = {res}        4960
                                                   {txt}Wald chi2({res}9{txt})    ={res}     28.39
{txt}Log pseudolikelihood =   {res}-47.504422                {txt}Prob > chi2     ={res}    0.0008

                                 {txt}(Std. Err. adjusted for {res}32{txt} clusters in ccode)
{hline 13}{c TT}{hline 64}
             {c |}               Robust
          _t {c |}      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
{hline 13}{c +}{hline 64}
    polpssum {c |}  {res}-.3454389   .1993485    -1.73   0.083    -.7361548     .045277
    {txt}milpssum {c |}  {res} .2596181   .4398958     0.59   0.555    -.6025618    1.121798
   {txt}econpssum {c |}  {res} .5661454   .4658488     1.22   0.224    -.3469013    1.479192
   {txt}terrpssum {c |}  {res}-1.129002   .8967675    -1.26   0.208    -2.886634    .6286302
     {txt}costinc {c |}  {res}-.4942256   .1696284    -2.91   0.004    -.8266911   -.1617601
   {txt}guarantee {c |}  {res}-1.165149   .6738459    -1.73   0.084    -2.485863    .1555645
       {txt}issue {c |}  {res} 1.087154    .413056     2.63   0.008     .2775795    1.896729
       {txt}costs {c |}  {res}  .368284   .2164089     1.70   0.089    -.0558697    .7924377
    {txt}duration {c |}  {res}   .15373   .8320729     0.18   0.853    -1.477103    1.784563
{txt}{hline 13}{c BT}{hline 64}

{com}. 
. stcurve, hazard
{txt}
{com}. drop hazard
{txt}
{com}. 
. **Proportional Hazard Test 
. stcox polpssum milpssum econpssum terrpssum costinc guarantee issue costs duration, robust efron sch(sch*) sca(sca*) 

         {txt}failure _d:  {res}peacefail
   {txt}analysis time _t:  {res}peacedur
                 {txt}id:  {res}idnumber

{txt}Iteration 0:   log pseudolikelihood = {res}-59.247769
{txt}Iteration 1:   log pseudolikelihood = {res}-48.798652
{txt}Iteration 2:   log pseudolikelihood = {res}-47.596788
{txt}Iteration 3:   log pseudolikelihood = {res}-47.504673
{txt}Iteration 4:   log pseudolikelihood = {res}-47.504422
{txt}Refining estimates:
Iteration 0:   log pseudolikelihood = {res}-47.504422

{txt}Cox regression -- Efron method for ties

No. of subjects      = {res}          46                {txt}Number of obs   ={res}        46
{txt}No. of failures      = {res}          18
{txt}Time at risk         = {res}        4960
                                                   {txt}Wald chi2({res}9{txt})    ={res}     21.20
{txt}Log pseudolikelihood =   {res}-47.504422                {txt}Prob > chi2     ={res}    0.0118

                              {txt}(Std. Err. adjusted for {res}46{txt} clusters in idnumber)
{hline 13}{c TT}{hline 64}
             {c |}               Robust
          _t {c |} Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
{hline 13}{c +}{hline 64}
    polpssum {c |}  {res} .7079096   .1738182    -1.41   0.159      .437498    1.145459
    {txt}milpssum {c |}  {res} 1.296435   .5394598     0.62   0.533     .5735313    2.930518
   {txt}econpssum {c |}  {res} 1.761464    .839818     1.19   0.235     .6919014    4.484391
   {txt}terrpssum {c |}  {res} .3233559   .2655072    -1.37   0.169     .0646785    1.616596
     {txt}costinc {c |}  {res} .6100431   .1279198    -2.36   0.018     .4044569    .9201292
   {txt}guarantee {c |}  {res} .3118761   .2166194    -1.68   0.093       .07994    1.216747
       {txt}issue {c |}  {res} 2.965823   1.319409     2.44   0.015     1.240138    7.092843
       {txt}costs {c |}  {res} 1.445252    .327948     1.62   0.105     .9263906    2.254723
    {txt}duration {c |}  {res} 1.166176   1.071411     0.17   0.867     .1926337    7.059856
{txt}{hline 13}{c BT}{hline 64}

{com}. stphtest, detail

{txt}      Test of proportional hazards assumption

      Time:  {res}Time
{txt}      {hline 12}{c TT}{hline 51}
                  {c |}       rho            chi2       df       Prob>chi2
      {hline 12}{c +}{hline 51}
      polpssum{col 19}{c |}{res}{col 25} 0.22824{col 37}     3.09{col 50}    1{col 64}0.0788
{txt}      milpssum{col 19}{c |}{res}{col 25} 0.07757{col 37}     0.53{col 50}    1{col 64}0.4665
{txt}      econpssum{col 19}{c |}{res}{col 25} 0.14686{col 37}     1.23{col 50}    1{col 64}0.2671
{txt}      terrpssum{col 19}{c |}{res}{col 25} 0.06987{col 37}     0.17{col 50}    1{col 64}0.6803
{txt}      costinc{col 19}{c |}{res}{col 25}-0.20801{col 37}     0.35{col 50}    1{col 64}0.5532
{txt}      guarantee{col 19}{c |}{res}{col 25}-0.03065{col 37}     0.05{col 50}    1{col 64}0.8180
{txt}      issue{col 19}{c |}{res}{col 25} 0.17281{col 37}     0.88{col 50}    1{col 64}0.3495
{txt}      costs{col 19}{c |}{res}{col 25} 0.21888{col 37}     3.34{col 50}    1{col 64}0.0675
{txt}      duration{col 19}{c |}{res}{col 25}-0.18310{col 37}     4.13{col 50}    1{col 64}0.0421
{txt}      {hline 12}{c +}{hline 51}
      global test {c |}{res}{col 37}     7.14{col 50}    9{col 64}0.6229
{txt}      {hline 12}{c BT}{hline 51}

note: robust variance-covariance matrix used.

{com}. drop sch* sca*
{txt}
{com}. stcox polpssum milpssum econpssum terrpssum costinc guarantee issue, efron cluster(ccode) sch(sch*) sca(sca*)

         {txt}failure _d:  {res}peacefail
   {txt}analysis time _t:  {res}peacedur
                 {txt}id:  {res}idnumber

{txt}Iteration 0:   log pseudolikelihood = {res}-59.247769
{txt}Iteration 1:   log pseudolikelihood = {res}-49.845127
{txt}Iteration 2:   log pseudolikelihood = {res}-49.209566
{txt}Iteration 3:   log pseudolikelihood = {res}-49.197014
{txt}Iteration 4:   log pseudolikelihood = {res}-49.197008
{txt}Refining estimates:
Iteration 0:   log pseudolikelihood = {res}-49.197008

{txt}Cox regression -- Efron method for ties

No. of subjects      = {res}          46                {txt}Number of obs   ={res}        46
{txt}No. of failures      = {res}          18
{txt}Time at risk         = {res}        4960
                                                   {txt}Wald chi2({res}7{txt})    ={res}     24.84
{txt}Log pseudolikelihood =   {res}-49.197008                {txt}Prob > chi2     ={res}    0.0008

                                 {txt}(Std. Err. adjusted for {res}32{txt} clusters in ccode)
{hline 13}{c TT}{hline 64}
             {c |}               Robust
          _t {c |} Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
{hline 13}{c +}{hline 64}
    polpssum {c |}  {res} .7211042   .1314216    -1.79   0.073     .5045057    1.030694
    {txt}milpssum {c |}  {res} 1.193832   .4003204     0.53   0.597     .6187496    2.303411
   {txt}econpssum {c |}  {res} 1.754982   .7111305     1.39   0.165     .7931587     3.88316
   {txt}terrpssum {c |}  {res} .3156641   .2442692    -1.49   0.136     .0692697    1.438492
     {txt}costinc {c |}  {res}  .568134   .1134903    -2.83   0.005      .384074     .840401
   {txt}guarantee {c |}  {res} .3751538   .2181175    -1.69   0.092     .1200367    1.172478
       {txt}issue {c |}  {res} 2.755396   1.133761     2.46   0.014     1.230101    6.172022
{txt}{hline 13}{c BT}{hline 64}

{com}. stphtest, detail

{txt}      Test of proportional hazards assumption

      Time:  {res}Time
{txt}      {hline 12}{c TT}{hline 51}
                  {c |}       rho            chi2       df       Prob>chi2
      {hline 12}{c +}{hline 51}
      polpssum{col 19}{c |}{res}{col 25} 0.07093{col 37}     0.05{col 50}    1{col 64}0.8180
{txt}      milpssum{col 19}{c |}{res}{col 25}-0.14226{col 37}     0.79{col 50}    1{col 64}0.3735
{txt}      econpssum{col 19}{c |}{res}{col 25} 0.00397{col 37}     0.00{col 50}    1{col 64}0.9863
{txt}      terrpssum{col 19}{c |}{res}{col 25}-0.10108{col 37}     0.29{col 50}    1{col 64}0.5931
{txt}      costinc{col 19}{c |}{res}{col 25}-0.20967{col 37}     0.59{col 50}    1{col 64}0.4415
{txt}      guarantee{col 19}{c |}{res}{col 25} 0.14476{col 37}     0.37{col 50}    1{col 64}0.5445
{txt}      issue{col 19}{c |}{res}{col 25} 0.05962{col 37}     0.08{col 50}    1{col 64}0.7808
{txt}      {hline 12}{c +}{hline 51}
      global test {c |}{res}{col 37}     1.95{col 50}    7{col 64}0.9626
{txt}      {hline 12}{c BT}{hline 51}

note: robust variance-covariance matrix used.

{com}. drop sch* sca*
{txt}
{com}. 
. **Inclusion of individual cost-increasing provisions one at a time
. stcox polpssum milpssum econpssum terrpssum guarantee sepforce issue costs duration, efron cluster(ccode) 

         {txt}failure _d:  {res}peacefail
   {txt}analysis time _t:  {res}peacedur
                 {txt}id:  {res}idnumber

{txt}Iteration 0:   log pseudolikelihood = {res}-59.247769
{txt}Iteration 1:   log pseudolikelihood = {res}-48.875364
{txt}Iteration 2:   log pseudolikelihood = {res}-47.652123
{txt}Iteration 3:   log pseudolikelihood = {res}-47.556147
{txt}Iteration 4:   log pseudolikelihood = {res}-47.556014
{txt}Refining estimates:
Iteration 0:   log pseudolikelihood = {res}-47.556014

{txt}Cox regression -- Efron method for ties

No. of subjects      = {res}          46                {txt}Number of obs   ={res}        46
{txt}No. of failures      = {res}          18
{txt}Time at risk         = {res}        4960
                                                   {txt}Wald chi2({res}9{txt})    ={res}     23.64
{txt}Log pseudolikelihood =   {res}-47.556014                {txt}Prob > chi2     ={res}    0.0049

                                 {txt}(Std. Err. adjusted for {res}32{txt} clusters in ccode)
{hline 13}{c TT}{hline 64}
             {c |}               Robust
          _t {c |} Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
{hline 13}{c +}{hline 64}
    polpssum {c |}  {res} .6223618   .1494629    -1.97   0.048     .3887078    .9964664
    {txt}milpssum {c |}  {res}  1.47472   .6573031     0.87   0.383     .6156264     3.53266
   {txt}econpssum {c |}  {res} 1.869066   .8788401     1.33   0.183     .7436818    4.697448
   {txt}terrpssum {c |}  {res} .3162066   .3249014    -1.12   0.262      .042205    2.369072
   {txt}guarantee {c |}  {res} .2819004   .1991784    -1.79   0.073     .0705787    1.125946
    {txt}sepforce {c |}  {res} .3309268      .2169    -1.69   0.092     .0915856     1.19574
       {txt}issue {c |}  {res} 3.553884   1.557233     2.89   0.004     1.505655    8.388435
       {txt}costs {c |}  {res} 1.594344   .3722211     2.00   0.046     1.008922    2.519455
    {txt}duration {c |}  {res} 1.761126   1.631474     0.61   0.541     .2865851     10.8225
{txt}{hline 13}{c BT}{hline 64}

{com}. 
. stcox polpssum milpssum econpssum terrpssum guarantee peacekeep issue costs duration, efron cluster(ccode) 

         {txt}failure _d:  {res}peacefail
   {txt}analysis time _t:  {res}peacedur
                 {txt}id:  {res}idnumber

{txt}Iteration 0:   log pseudolikelihood = {res}-59.247769
{txt}Iteration 1:   log pseudolikelihood = {res}-47.537193
{txt}Iteration 2:   log pseudolikelihood = {res}-46.378122
{txt}Iteration 3:   log pseudolikelihood = {res}-46.320407
{txt}Iteration 4:   log pseudolikelihood = {res}-46.320165
{txt}Iteration 5:   log pseudolikelihood = {res}-46.320165
{txt}Refining estimates:
Iteration 0:   log pseudolikelihood = {res}-46.320165

{txt}Cox regression -- Efron method for ties

No. of subjects      = {res}          46                {txt}Number of obs   ={res}        46
{txt}No. of failures      = {res}          18
{txt}Time at risk         = {res}        4960
                                                   {txt}Wald chi2({res}9{txt})    ={res}     50.74
{txt}Log pseudolikelihood =   {res}-46.320165                {txt}Prob > chi2     ={res}    0.0000

                                 {txt}(Std. Err. adjusted for {res}32{txt} clusters in ccode)
{hline 13}{c TT}{hline 64}
             {c |}               Robust
          _t {c |} Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
{hline 13}{c +}{hline 64}
    polpssum {c |}  {res} .6989004   .1600065    -1.56   0.118     .4462117    1.094686
    {txt}milpssum {c |}  {res}  1.08107   .5053106     0.17   0.868     .4325015    2.702215
   {txt}econpssum {c |}  {res} 1.854234   .8705499     1.32   0.188     .7388074    4.653693
   {txt}terrpssum {c |}  {res} .3347913   .2532867    -1.45   0.148     .0759971    1.474863
   {txt}guarantee {c |}  {res} .2209788   .1460906    -2.28   0.022     .0604805    .8073944
   {txt}peacekeep {c |}  {res} .2977081     .15547    -2.32   0.020     .1069729    .8285289
       {txt}issue {c |}  {res} 2.568701   1.110403     2.18   0.029     1.100917    5.993391
       {txt}costs {c |}  {res} 1.373382   .3057081     1.43   0.154     .8878064    2.124539
    {txt}duration {c |}  {res} .9838501   .8419548    -0.02   0.985     .1838618    5.264612
{txt}{hline 13}{c BT}{hline 64}

{com}. 
. stcox polpssum milpssum econpssum terrpssum guarantee sealed issue costs duration, efron cluster(ccode) 

         {txt}failure _d:  {res}peacefail
   {txt}analysis time _t:  {res}peacedur
                 {txt}id:  {res}idnumber

{txt}Iteration 0:   log pseudolikelihood = {res}-59.247769
{txt}Iteration 1:   log pseudolikelihood = {res}-49.663224
{txt}Iteration 2:   log pseudolikelihood = {res}-48.757511
{txt}Iteration 3:   log pseudolikelihood = {res}-48.729038
{txt}Iteration 4:   log pseudolikelihood = {res}-48.729018
{txt}Refining estimates:
Iteration 0:   log pseudolikelihood = {res}-48.729018

{txt}Cox regression -- Efron method for ties

No. of subjects      = {res}          46                {txt}Number of obs   ={res}        46
{txt}No. of failures      = {res}          18
{txt}Time at risk         = {res}        4960
                                                   {txt}Wald chi2({res}9{txt})    ={res}     33.08
{txt}Log pseudolikelihood =   {res}-48.729018                {txt}Prob > chi2     ={res}    0.0001

                                 {txt}(Std. Err. adjusted for {res}32{txt} clusters in ccode)
{hline 13}{c TT}{hline 64}
             {c |}               Robust
          _t {c |} Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
{hline 13}{c +}{hline 64}
    polpssum {c |}  {res} .6959742   .1410596    -1.79   0.074     .4678129    1.035414
    {txt}milpssum {c |}  {res} .8933125   .4388757    -0.23   0.818     .3410487    2.339863
   {txt}econpssum {c |}  {res}  1.84061    .822425     1.37   0.172      .766701    4.418728
   {txt}terrpssum {c |}  {res} .3270875   .3122605    -1.17   0.242     .0503556    2.124614
   {txt}guarantee {c |}  {res} .2507833   .1565009    -2.22   0.027     .0738087    .8520979
      {txt}sealed {c |}  {res} .6832743   1.059041    -0.25   0.806     .0327548    14.25329
       {txt}issue {c |}  {res} 3.226355   1.335611     2.83   0.005     1.433313     7.26245
       {txt}costs {c |}  {res} 1.488535   .3514631     1.68   0.092      .937085    2.364499
    {txt}duration {c |}  {res} 1.436291   1.155672     0.45   0.653     .2967195    6.952463
{txt}{hline 13}{c BT}{hline 64}

{com}. 
. stcox polpssum milpssum econpssum terrpssum guarantee withdfor issue costs duration, efron cluster(ccode) 

         {txt}failure _d:  {res}peacefail
   {txt}analysis time _t:  {res}peacedur
                 {txt}id:  {res}idnumber

{txt}Iteration 0:   log pseudolikelihood = {res}-59.247769
{txt}Iteration 1:   log pseudolikelihood = {res}-49.475009
{txt}Iteration 2:   log pseudolikelihood = {res}-48.460239
{txt}Iteration 3:   log pseudolikelihood = {res}-48.422239
{txt}Iteration 4:   log pseudolikelihood = {res}-48.422213
{txt}Refining estimates:
Iteration 0:   log pseudolikelihood = {res}-48.422213

{txt}Cox regression -- Efron method for ties

No. of subjects      = {res}          46                {txt}Number of obs   ={res}        46
{txt}No. of failures      = {res}          18
{txt}Time at risk         = {res}        4960
                                                   {txt}Wald chi2({res}9{txt})    ={res}     43.14
{txt}Log pseudolikelihood =   {res}-48.422213                {txt}Prob > chi2     ={res}    0.0000

                                 {txt}(Std. Err. adjusted for {res}32{txt} clusters in ccode)
{hline 13}{c TT}{hline 64}
             {c |}               Robust
          _t {c |} Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
{hline 13}{c +}{hline 64}
    polpssum {c |}  {res} .6487841   .1615325    -1.74   0.082     .3982633    1.056891
    {txt}milpssum {c |}  {res} .8470962   .4008219    -0.35   0.726     .3350953    2.141397
   {txt}econpssum {c |}  {res} 1.933343    .807852     1.58   0.115     .8523784    4.385161
   {txt}terrpssum {c |}  {res} .3257162   .2778322    -1.32   0.188     .0612032    1.733423
   {txt}guarantee {c |}  {res}  .195199   .1499942    -2.13   0.033     .0432912    .8801473
    {txt}withdfor {c |}  {res} 1.730865   1.031719     0.92   0.357     .5381288    5.567244
       {txt}issue {c |}  {res} 3.420262   1.317066     3.19   0.001     1.607981    7.275082
       {txt}costs {c |}  {res} 1.529855   .3088617     2.11   0.035     1.029915    2.272474
    {txt}duration {c |}  {res} 1.741119   1.644832     0.59   0.557     .2733379    11.09065
{txt}{hline 13}{c BT}{hline 64}

{com}. 
. 
. **With aggregate power-sharing measure (Hartzell and Hoddie 2003, 2007)
. stcox psall costinc guarantee issue costs duration, efron cluster(ccode) 

         {txt}failure _d:  {res}peacefail
   {txt}analysis time _t:  {res}peacedur
                 {txt}id:  {res}idnumber

{txt}Iteration 0:   log pseudolikelihood = {res}-59.247769
{txt}Iteration 1:   log pseudolikelihood = {res}-50.038345
{txt}Iteration 2:   log pseudolikelihood = {res}-49.543519
{txt}Iteration 3:   log pseudolikelihood = {res}-49.540143
{txt}Iteration 4:   log pseudolikelihood = {res}-49.540143
{txt}Refining estimates:
Iteration 0:   log pseudolikelihood = {res}-49.540143

{txt}Cox regression -- Efron method for ties

No. of subjects      = {res}          46                {txt}Number of obs   ={res}        46
{txt}No. of failures      = {res}          18
{txt}Time at risk         = {res}        4960
                                                   {txt}Wald chi2({res}6{txt})    ={res}     22.70
{txt}Log pseudolikelihood =   {res}-49.540143                {txt}Prob > chi2     ={res}    0.0009

                                 {txt}(Std. Err. adjusted for {res}32{txt} clusters in ccode)
{hline 13}{c TT}{hline 64}
             {c |}               Robust
          _t {c |} Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
{hline 13}{c +}{hline 64}
       psall {c |}  {res} .8944988   .2499011    -0.40   0.690     .5173386    1.546624
     {txt}costinc {c |}  {res} .6575346   .1277358    -2.16   0.031     .4493246    .9622259
   {txt}guarantee {c |}  {res} .3205092   .1772454    -2.06   0.040     .1084216    .9474689
       {txt}issue {c |}  {res} 2.877683   1.307722     2.33   0.020     1.180937    7.012282
       {txt}costs {c |}  {res} 1.482939   .3031846     1.93   0.054      .993337     2.21386
    {txt}duration {c |}  {res}  .902282   .5955104    -0.16   0.876      .247483    3.289571
{txt}{hline 13}{c BT}{hline 64}

{com}. 
. **With cold war variable
. stcox polpssum milpssum econpssum terrpssum costinc guarantee issue costs duration coldwar, efron cluster(ccode) 

         {txt}failure _d:  {res}peacefail
   {txt}analysis time _t:  {res}peacedur
                 {txt}id:  {res}idnumber

{txt}Iteration 0:   log pseudolikelihood = {res}-59.247769
{txt}Iteration 1:   log pseudolikelihood = {res}-48.741997
{txt}Iteration 2:   log pseudolikelihood = {res}-47.472454
{txt}Iteration 3:   log pseudolikelihood = {res}-47.338096
{txt}Iteration 4:   log pseudolikelihood = {res}-47.337206
{txt}Iteration 5:   log pseudolikelihood = {res}-47.337206
{txt}Refining estimates:
Iteration 0:   log pseudolikelihood = {res}-47.337206

{txt}Cox regression -- Efron method for ties

No. of subjects      = {res}          46                {txt}Number of obs   ={res}        46
{txt}No. of failures      = {res}          18
{txt}Time at risk         = {res}        4960
                                                   {txt}Wald chi2({res}10{txt})   ={res}     32.20
{txt}Log pseudolikelihood =   {res}-47.337206                {txt}Prob > chi2     ={res}    0.0004

                                 {txt}(Std. Err. adjusted for {res}32{txt} clusters in ccode)
{hline 13}{c TT}{hline 64}
             {c |}               Robust
          _t {c |} Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
{hline 13}{c +}{hline 64}
    polpssum {c |}  {res} .6871735   .1657544    -1.56   0.120     .4282984     1.10252
    {txt}milpssum {c |}  {res}  1.31311   .5960562     0.60   0.548     .5394084    3.196573
   {txt}econpssum {c |}  {res} 1.634623   .8592111     0.93   0.350     .5834431    4.579698
   {txt}terrpssum {c |}  {res} .3177813   .2919948    -1.25   0.212     .0524805    1.924238
     {txt}costinc {c |}  {res} .6445605   .1371988    -2.06   0.039     .4246978    .9782444
   {txt}guarantee {c |}  {res} .2623862   .2135676    -1.64   0.100     .0532244    1.293514
       {txt}issue {c |}  {res}  3.01848   1.202006     2.77   0.006     1.383014    6.587947
       {txt}costs {c |}  {res}  1.41324   .3215295     1.52   0.128     .9048094    2.207368
    {txt}duration {c |}  {res} 1.153846    .937206     0.18   0.860     .2348354    5.669337
     {txt}coldwar {c |}  {res} 1.533704   1.327315     0.49   0.621     .2812455    8.363682
{txt}{hline 13}{c BT}{hline 64}

{com}. 
. **Drop truces and run analysis only with settlements
. drop if idnumber==2
{txt}(1 observation deleted)

{com}. drop if idnumber==6
{txt}(1 observation deleted)

{com}. drop if idnumber==11
{txt}(1 observation deleted)

{com}. drop if idnumber==12
{txt}(1 observation deleted)

{com}. drop if idnumber==21
{txt}(1 observation deleted)

{com}. drop if idnumber== float(8.1)
{txt}(1 observation deleted)

{com}. 
. stcox polpssum milpssum econpssum terrpssum costinc guarantee issue costs duration, efron cluster(ccode) 

         {txt}failure _d:  {res}peacefail
   {txt}analysis time _t:  {res}peacedur
                 {txt}id:  {res}idnumber

{txt}Iteration 0:   log pseudolikelihood = {res}-50.006977
{txt}Iteration 1:   log pseudolikelihood = {res}-40.847441
{txt}Iteration 2:   log pseudolikelihood = {res} -40.20402
{txt}Iteration 3:   log pseudolikelihood = {res}-40.187224
{txt}Iteration 4:   log pseudolikelihood = {res}-40.187217
{txt}Refining estimates:
Iteration 0:   log pseudolikelihood = {res}-40.187217

{txt}Cox regression -- Efron method for ties

No. of subjects      = {res}          40                {txt}Number of obs   ={res}        40
{txt}No. of failures      = {res}          16
{txt}Time at risk         = {res}        4282
                                                   {txt}Wald chi2({res}9{txt})    ={res}     27.74
{txt}Log pseudolikelihood =   {res}-40.187217                {txt}Prob > chi2     ={res}    0.0011

                                 {txt}(Std. Err. adjusted for {res}28{txt} clusters in ccode)
{hline 13}{c TT}{hline 64}
             {c |}               Robust
          _t {c |} Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
{hline 13}{c +}{hline 64}
    polpssum {c |}  {res}  .635994   .1587206    -1.81   0.070     .3899641    1.037245
    {txt}milpssum {c |}  {res} 1.234426   .5761184     0.45   0.652     .4945397    3.081264
   {txt}econpssum {c |}  {res} 1.621555   .8037845     0.98   0.329     .6137647     4.28412
   {txt}terrpssum {c |}  {res} .3058482   .3491402    -1.04   0.299     .0326452    2.865449
     {txt}costinc {c |}  {res} .5508182   .1238186    -2.65   0.008     .3545409    .8557563
   {txt}guarantee {c |}  {res} .2979144    .220782    -1.63   0.102     .0697064     1.27324
       {txt}issue {c |}  {res} 2.991434   1.325822     2.47   0.013     1.254936    7.130782
       {txt}costs {c |}  {res} 1.489609   .3091448     1.92   0.055     .9917881    2.237308
    {txt}duration {c |}  {res} 1.346598   1.261548     0.32   0.751     .2146829    8.446535
{txt}{hline 13}{c BT}{hline 64}

{com}. 
{txt}end of do-file

{com}. log close
       {txt}log:  {res}C:\Users\mattesmc\Documents\Papers\Civil Wars\Civil War I\ISQ\R&R\R&R2\ISQrep.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}13 Nov 2008, 14:45:31
{txt}{.-}
{smcl}
{txt}{sf}{ul off}