{smcl}
{com}{sf}{ul off}{txt}{.-}
       log:  {res}C:\Users\Go! Staring!\Documents\Download\Duration distribution data\Stata_Version\Stata-Log one per year.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 Mar 2009, 23:45:46

{com}. do "C:\Users\GO!STA~1\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. * The Duration of Interstate Wars, 1816-1985 - (Bennett and Stam 1996) - (APSR 90-2)
. * Stata commands for one case per war model: Table 1 - Model 1~4 (TVC)
. * This version generates predictions and computes error.
. 
. 
. ****************************************************************
. ** Commands to read data and estimate one case per war model  **
. ****************************************************************
. 
. clear
{txt}
{com}. 
. insheet using one_per_year.csv
{txt}(32 vars, 169 obs)

{com}. 
. * Note that a couple of variables were rescaled from this original data to give the coefficients in Table 1.
. replace summper = summper/1000
{txt}(169 real changes made)

{com}. replace sumpop = sumpop/1000000
{txt}(169 real changes made)

{com}. replace reprsum=-1*reprsum
{txt}(169 real changes made)

{com}. 
. * In LIMDEP, war-years with censor==1 are those where the end of war is observed, so some are not censored by theory. Need to recode censoring in Stata
. gen end=0
{txt}
{com}. replace end=1 if year==lastyear
{txt}(78 real changes made)

{com}. stset time, id(warnum) fail(end)

                {txt}id:  {res}warnum
     {txt}failure event:  {res}end != 0 & end < .
{txt}obs. time interval:  {res}(time[_n-1], time]
{txt} exit on or before:  {res}failure

{txt}{hline 78}
{res}      169{txt}  total obs.
{res}        0{txt}  exclusions
{hline 78}
{res}      169{txt}  obs. remaining, representing
{res}       78{txt}  subjects
{res}       78{txt}  failures in single failure-per-subject data
{res}  1226.47{txt}  total analysis time at risk, at risk from t = {res}        0
                             {txt}earliest observed entry t = {res}        0
                                  {txt}last observed exit t = {res}      121
{txt}
{com}. 
. * Model 1
. streg popratio year nactors, dist(weibull) nohr time 

         {txt}failure _d:  {res}end
   {txt}analysis time _t:  {res}time
                 {txt}id:  {res}warnum

{txt}Fitting constant-only model:

Iteration 0:   log likelihood = {res}-175.66142
{txt}Iteration 1:   log likelihood = {res}-157.82696
{txt}Iteration 2:   log likelihood = {res}-157.54593
{txt}Iteration 3:   log likelihood = {res}-157.54586
{txt}Iteration 4:   log likelihood = {res}-157.54586

{txt}Fitting full model:

Iteration 0:{col 16}log likelihood = {res}-157.54586{txt}  
Iteration 1:{col 16}log likelihood = {res}-156.44747{txt}  
Iteration 2:{col 16}log likelihood = {res}-156.38077{txt}  
Iteration 3:{col 16}log likelihood = {res}-156.38058{txt}  
Iteration 4:{col 16}log likelihood = {res}-156.38058{txt}  

Weibull regression -- accelerated failure-time form 

No. of subjects = {res}          78                     {txt}Number of obs   ={res}       169
{txt}No. of failures = {res}          78
{txt}Time at risk    = {res}     1226.47
                                                   {txt}LR chi2({res}3{txt})      ={res}      2.33
{txt}Log likelihood  =   {res}-156.38058                     {txt}Prob > chi2     ={res}    0.5067

{col 1}{text}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}          _t{col 14}{c |}      Coef.{col 26}   Std. Err.{col 37}      z{col 46}   P>|z|{col 55}    [95% Conf. Interval]
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}    popratio{col 14}{c |}{result}{space 2}-.0237701{col 26}{space 2} .0164963{col 37}{space 1}   -1.44{col 46}{space 3}0.150{col 55}{space 3}-.0561022{col 67}{space 3} .0085621
{col 1}{text}        year{col 14}{c |}{result}{space 2} -.000914{col 26}{space 2} .0041477{col 37}{space 1}   -0.22{col 46}{space 3}0.826{col 55}{space 3}-.0090434{col 67}{space 3} .0072154
{col 1}{text}     nactors{col 14}{c |}{result}{space 2} .0638854{col 26}{space 2} .1056184{col 37}{space 1}    0.60{col 46}{space 3}0.545{col 55}{space 3} -.143123{col 67}{space 3} .2708937
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} 4.143468{col 26}{space 2} 7.991437{col 37}{space 1}    0.52{col 46}{space 3}0.604{col 55}{space 3}-11.51946{col 67}{space 3}  19.8064
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}       /ln_p{col 14}{c |}{result}{space 2}-.4639892{col 27}{space 1} .0865484{col 39}  -5.36{col 47}{space 2}0.000{col 55}{space 3} -.633621{col 67}{space 3}-.2943574
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 8}{hline 8}{hline 12}{hline 12}
{col 1}{text}           p{col 14}{c |}{result}{space 2} .6287703{col 27}{space 1} .0544191{col 55}{space 3} .5306668{col 67}{space 3} .7450102
{col 1}{text}         1/p{col 14}{c |}{result}{space 2} 1.590406{col 27}{space 1} .1376471{col 55}{space 3} 1.342264{col 67}{space 3} 1.884422
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}

{com}. 
. * Model 2
. streg oadm oada oadp opda rterrain rterrstr bofadj summper sumpop popratio qualrat surpdiff salscale, dist(weibull) nohr time 

         {txt}failure _d:  {res}end
   {txt}analysis time _t:  {res}time
                 {txt}id:  {res}warnum

{txt}Fitting constant-only model:

Iteration 0:   log likelihood = {res}-175.66142
{txt}Iteration 1:   log likelihood = {res}-157.82696
{txt}Iteration 2:   log likelihood = {res}-157.54593
{txt}Iteration 3:   log likelihood = {res}-157.54586
{txt}Iteration 4:   log likelihood = {res}-157.54586

{txt}Fitting full model:

Iteration 0:{col 16}log likelihood = {res}-157.54586{txt}  
Iteration 1:{col 16}log likelihood = {res}-141.40374{txt}  
Iteration 2:{col 16}log likelihood = {res}-127.99452{txt}  
Iteration 3:{col 16}log likelihood = {res}-127.51146{txt}  
Iteration 4:{col 16}log likelihood = {res}-127.48619{txt}  
Iteration 5:{col 16}log likelihood = {res}-127.48609{txt}  
Iteration 6:{col 16}log likelihood = {res}-127.48609{txt}  

Weibull regression -- accelerated failure-time form 

No. of subjects = {res}          78                     {txt}Number of obs   ={res}       169
{txt}No. of failures = {res}          78
{txt}Time at risk    = {res}     1226.47
                                                   {txt}LR chi2({res}13{txt})     ={res}     60.12
{txt}Log likelihood  =   {res}-127.48609                     {txt}Prob > chi2     ={res}    0.0000

{col 1}{text}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}          _t{col 14}{c |}      Coef.{col 26}   Std. Err.{col 37}      z{col 46}   P>|z|{col 55}    [95% Conf. Interval]
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}        oadm{col 14}{c |}{result}{space 2} 2.484015{col 26}{space 2} .6920123{col 37}{space 1}    3.59{col 46}{space 3}0.000{col 55}{space 3} 1.127696{col 67}{space 3} 3.840335
{col 1}{text}        oada{col 14}{c |}{result}{space 2} 3.253752{col 26}{space 2} .7155836{col 37}{space 1}    4.55{col 46}{space 3}0.000{col 55}{space 3} 1.851234{col 67}{space 3}  4.65627
{col 1}{text}        oadp{col 14}{c |}{result}{space 2} 7.016061{col 26}{space 2}  1.81957{col 37}{space 1}    3.86{col 46}{space 3}0.000{col 55}{space 3}  3.44977{col 67}{space 3} 10.58235
{col 1}{text}        opda{col 14}{c |}{result}{space 2} 11.59573{col 26}{space 2} 3.145259{col 37}{space 1}    3.69{col 46}{space 3}0.000{col 55}{space 3} 5.431137{col 67}{space 3} 17.76032
{col 1}{text}    rterrain{col 14}{c |}{result}{space 2} 6.618471{col 26}{space 2} 3.257661{col 37}{space 1}    2.03{col 46}{space 3}0.042{col 55}{space 3} .2335732{col 67}{space 3} 13.00337
{col 1}{text}    rterrstr{col 14}{c |}{result}{space 2}-2.025752{col 26}{space 2} .8622852{col 37}{space 1}   -2.35{col 46}{space 3}0.019{col 55}{space 3}  -3.7158{col 67}{space 3}-.3357041
{col 1}{text}      bofadj{col 14}{c |}{result}{space 2}-5.026929{col 26}{space 2}  1.18381{col 37}{space 1}   -4.25{col 46}{space 3}0.000{col 55}{space 3}-7.347153{col 67}{space 3}-2.706705
{col 1}{text}     summper{col 14}{c |}{result}{space 2} .0610301{col 26}{space 2} .0415181{col 37}{space 1}    1.47{col 46}{space 3}0.142{col 55}{space 3} -.020344{col 67}{space 3} .1424041
{col 1}{text}      sumpop{col 14}{c |}{result}{space 2} .7510678{col 26}{space 2} .5451351{col 37}{space 1}    1.38{col 46}{space 3}0.168{col 55}{space 3}-.3173773{col 67}{space 3} 1.819513
{col 1}{text}    popratio{col 14}{c |}{result}{space 2} .0005608{col 26}{space 2} .0151928{col 37}{space 1}    0.04{col 46}{space 3}0.971{col 55}{space 3}-.0292165{col 67}{space 3} .0303382
{col 1}{text}     qualrat{col 14}{c |}{result}{space 2}  .013007{col 26}{space 2} .0109946{col 37}{space 1}    1.18{col 46}{space 3}0.237{col 55}{space 3}-.0085421{col 67}{space 3}  .034556
{col 1}{text}    surpdiff{col 14}{c |}{result}{space 2}-.1232752{col 26}{space 2} .6293954{col 37}{space 1}   -0.20{col 46}{space 3}0.845{col 55}{space 3}-1.356868{col 67}{space 3} 1.110317
{col 1}{text}    salscale{col 14}{c |}{result}{space 2} .3363409{col 26}{space 2} .2689844{col 37}{space 1}    1.25{col 46}{space 3}0.211{col 55}{space 3}-.1908588{col 67}{space 3} .8635406
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} 2.462208{col 26}{space 2} 1.178432{col 37}{space 1}    2.09{col 46}{space 3}0.037{col 55}{space 3} .1525241{col 67}{space 3} 4.771892
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}       /ln_p{col 14}{c |}{result}{space 2}-.0975137{col 27}{space 1} .0882123{col 39}  -1.11{col 47}{space 2}0.269{col 55}{space 3}-.2704066{col 67}{space 3} .0753791
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 8}{hline 8}{hline 12}{hline 12}
{col 1}{text}           p{col 14}{c |}{result}{space 2} .9070899{col 27}{space 1} .0800164{col 55}{space 3} .7630692{col 67}{space 3} 1.078293
{col 1}{text}         1/p{col 14}{c |}{result}{space 2} 1.102427{col 27}{space 1} .0972475{col 55}{space 3} .9273918{col 67}{space 3} 1.310497
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}

{com}. 
. * Model 3
. streg reprsum demosum, dist(weibull) nohr time 

         {txt}failure _d:  {res}end
   {txt}analysis time _t:  {res}time
                 {txt}id:  {res}warnum

{txt}Fitting constant-only model:

Iteration 0:   log likelihood = {res}-175.66142
{txt}Iteration 1:   log likelihood = {res}-157.82696
{txt}Iteration 2:   log likelihood = {res}-157.54593
{txt}Iteration 3:   log likelihood = {res}-157.54586
{txt}Iteration 4:   log likelihood = {res}-157.54586

{txt}Fitting full model:

Iteration 0:{col 16}log likelihood = {res}-157.54586{txt}  
Iteration 1:{col 16}log likelihood = {res}-155.87388{txt}  
Iteration 2:{col 16}log likelihood = {res} -155.8552{txt}  
Iteration 3:{col 16}log likelihood = {res} -155.8552{txt}  

Weibull regression -- accelerated failure-time form 

No. of subjects = {res}          78                     {txt}Number of obs   ={res}       169
{txt}No. of failures = {res}          78
{txt}Time at risk    = {res}     1226.47
                                                   {txt}LR chi2({res}2{txt})      ={res}      3.38
{txt}Log likelihood  =   {res} -155.8552                     {txt}Prob > chi2     ={res}    0.1844

{col 1}{text}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}          _t{col 14}{c |}      Coef.{col 26}   Std. Err.{col 37}      z{col 46}   P>|z|{col 55}    [95% Conf. Interval]
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}     reprsum{col 14}{c |}{result}{space 2}-.2811613{col 26}{space 2} .1680275{col 37}{space 1}   -1.67{col 46}{space 3}0.094{col 55}{space 3}-.6104891{col 67}{space 3} .0481665
{col 1}{text}     demosum{col 14}{c |}{result}{space 2}-.1296592{col 26}{space 2} .0735597{col 37}{space 1}   -1.76{col 46}{space 3}0.078{col 55}{space 3}-.2738335{col 67}{space 3} .0145151
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} 1.746093{col 26}{space 2} .5888207{col 37}{space 1}    2.97{col 46}{space 3}0.003{col 55}{space 3} .5920254{col 67}{space 3}  2.90016
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}       /ln_p{col 14}{c |}{result}{space 2}-.4637246{col 27}{space 1} .0861565{col 39}  -5.38{col 47}{space 2}0.000{col 55}{space 3}-.6325883{col 67}{space 3} -.294861
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 8}{hline 8}{hline 12}{hline 12}
{col 1}{text}           p{col 14}{c |}{result}{space 2} .6289367{col 27}{space 1}  .054187{col 55}{space 3} .5312151{col 67}{space 3} .7446351
{col 1}{text}         1/p{col 14}{c |}{result}{space 2} 1.589985{col 27}{space 1} .1369876{col 55}{space 3}  1.34294{col 67}{space 3} 1.882477
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}

{com}. 
. * Model 4
. streg oadm oada oadp opda rterrain rterrstr bofadj summper sumpop popratio qualrat surpdiff salscale reprsum demosum adis3010 nactors, dist(weibull) nohr time 

         {txt}failure _d:  {res}end
   {txt}analysis time _t:  {res}time
                 {txt}id:  {res}warnum

{txt}Fitting constant-only model:

Iteration 0:   log likelihood = {res}-175.66142
{txt}Iteration 1:   log likelihood = {res}-157.82696
{txt}Iteration 2:   log likelihood = {res}-157.54593
{txt}Iteration 3:   log likelihood = {res}-157.54586
{txt}Iteration 4:   log likelihood = {res}-157.54586

{txt}Fitting full model:

Iteration 0:{col 16}log likelihood = {res}-157.54586{txt}  
Iteration 1:{col 16}log likelihood = {res}-143.03908{txt}  
Iteration 2:{col 16}log likelihood = {res}-125.65393{txt}  
Iteration 3:{col 16}log likelihood = {res}-124.84729{txt}  
Iteration 4:{col 16}log likelihood = {res}-124.82762{txt}  
Iteration 5:{col 16}log likelihood = {res}-124.82754{txt}  
Iteration 6:{col 16}log likelihood = {res}-124.82754{txt}  

Weibull regression -- accelerated failure-time form 

No. of subjects = {res}          78                     {txt}Number of obs   ={res}       169
{txt}No. of failures = {res}          78
{txt}Time at risk    = {res}     1226.47
                                                   {txt}LR chi2({res}17{txt})     ={res}     65.44
{txt}Log likelihood  =   {res}-124.82754                     {txt}Prob > chi2     ={res}    0.0000

{col 1}{text}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}          _t{col 14}{c |}      Coef.{col 26}   Std. Err.{col 37}      z{col 46}   P>|z|{col 55}    [95% Conf. Interval]
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}        oadm{col 14}{c |}{result}{space 2} 2.759301{col 26}{space 2} .6966673{col 37}{space 1}    3.96{col 46}{space 3}0.000{col 55}{space 3} 1.393858{col 67}{space 3} 4.124744
{col 1}{text}        oada{col 14}{c |}{result}{space 2} 3.203406{col 26}{space 2} .6777434{col 37}{space 1}    4.73{col 46}{space 3}0.000{col 55}{space 3} 1.875053{col 67}{space 3} 4.531758
{col 1}{text}        oadp{col 14}{c |}{result}{space 2} 6.285461{col 26}{space 2} 1.767461{col 37}{space 1}    3.56{col 46}{space 3}0.000{col 55}{space 3} 2.821301{col 67}{space 3}  9.74962
{col 1}{text}        opda{col 14}{c |}{result}{space 2} 10.99144{col 26}{space 2} 3.053562{col 37}{space 1}    3.60{col 46}{space 3}0.000{col 55}{space 3} 5.006569{col 67}{space 3} 16.97631
{col 1}{text}    rterrain{col 14}{c |}{result}{space 2} 5.062084{col 26}{space 2} 3.225936{col 37}{space 1}    1.57{col 46}{space 3}0.117{col 55}{space 3}-1.260634{col 67}{space 3}  11.3848
{col 1}{text}    rterrstr{col 14}{c |}{result}{space 2}-1.703234{col 26}{space 2} .8543723{col 37}{space 1}   -1.99{col 46}{space 3}0.046{col 55}{space 3}-3.377773{col 67}{space 3}-.0286947
{col 1}{text}      bofadj{col 14}{c |}{result}{space 2} -4.75618{col 26}{space 2} 1.156307{col 37}{space 1}   -4.11{col 46}{space 3}0.000{col 55}{space 3}-7.022501{col 67}{space 3}-2.489859
{col 1}{text}     summper{col 14}{c |}{result}{space 2} .1239886{col 26}{space 2} .0463974{col 37}{space 1}    2.67{col 46}{space 3}0.008{col 55}{space 3} .0330513{col 67}{space 3} .2149258
{col 1}{text}      sumpop{col 14}{c |}{result}{space 2} .7067902{col 26}{space 2}  .547452{col 37}{space 1}    1.29{col 46}{space 3}0.197{col 55}{space 3} -.366196{col 67}{space 3} 1.779776
{col 1}{text}    popratio{col 14}{c |}{result}{space 2} .0069696{col 26}{space 2} .0149948{col 37}{space 1}    0.46{col 46}{space 3}0.642{col 55}{space 3}-.0224198{col 67}{space 3} .0363589
{col 1}{text}     qualrat{col 14}{c |}{result}{space 2} .0101149{col 26}{space 2}   .00963{col 37}{space 1}    1.05{col 46}{space 3}0.294{col 55}{space 3}-.0087595{col 67}{space 3} .0289893
{col 1}{text}    surpdiff{col 14}{c |}{result}{space 2}-.2032023{col 26}{space 2} .6196589{col 37}{space 1}   -0.33{col 46}{space 3}0.743{col 55}{space 3}-1.417711{col 67}{space 3} 1.011307
{col 1}{text}    salscale{col 14}{c |}{result}{space 2} .4195679{col 26}{space 2} .2720156{col 37}{space 1}    1.54{col 46}{space 3}0.123{col 55}{space 3}-.1135728{col 67}{space 3} .9527087
{col 1}{text}     reprsum{col 14}{c |}{result}{space 2} -.199923{col 26}{space 2} .1271987{col 37}{space 1}   -1.57{col 46}{space 3}0.116{col 55}{space 3}-.4492278{col 67}{space 3} .0493819
{col 1}{text}     demosum{col 14}{c |}{result}{space 2}-.1002182{col 26}{space 2} .0550751{col 37}{space 1}   -1.82{col 46}{space 3}0.069{col 55}{space 3}-.2081633{col 67}{space 3}  .007727
{col 1}{text}    adis3010{col 14}{c |}{result}{space 2} -.008049{col 26}{space 2} .0576689{col 37}{space 1}   -0.14{col 46}{space 3}0.889{col 55}{space 3}-.1210779{col 67}{space 3} .1049799
{col 1}{text}     nactors{col 14}{c |}{result}{space 2}-.1898279{col 26}{space 2} .0982529{col 37}{space 1}   -1.93{col 46}{space 3}0.053{col 55}{space 3}-.3824001{col 67}{space 3} .0027443
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} 2.251671{col 26}{space 2} 1.227877{col 37}{space 1}    1.83{col 46}{space 3}0.067{col 55}{space 3}-.1549243{col 67}{space 3} 4.658266
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}       /ln_p{col 14}{c |}{result}{space 2}-.0357793{col 27}{space 1} .0912167{col 39}  -0.39{col 47}{space 2}0.695{col 55}{space 3}-.2145608{col 67}{space 3} .1430022
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 8}{hline 8}{hline 12}{hline 12}
{col 1}{text}           p{col 14}{c |}{result}{space 2} .9648532{col 27}{space 1} .0880107{col 55}{space 3} .8068957{col 67}{space 3} 1.153732
{col 1}{text}         1/p{col 14}{c |}{result}{space 2} 1.036427{col 27}{space 1} .0945395{col 55}{space 3} .8667522{col 67}{space 3} 1.239317
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}

{com}. 
. * note: Adding the "robust" subcommand to the following equations will change the s.e. slightly, and in fact strengthen some results we found without robust s.e. estimates.
. 
. 
. 
. **********************************************************************
. ** Commands to do predicted values for Model 4 (Complete TVC model) **
. **********************************************************************
. 
. * Naive model
. streg , dist(weibull) nohr time  robust

         {txt}failure _d:  {res}end
   {txt}analysis time _t:  {res}time
                 {txt}id:  {res}warnum

{txt}Fitting constant-only model:

Iteration 0:   log pseudolikelihood = {res}-175.66142
{txt}Iteration 1:   log pseudolikelihood = {res}-157.82696
{txt}Iteration 2:   log pseudolikelihood = {res}-157.54593
{txt}Iteration 3:   log pseudolikelihood = {res}-157.54586
{txt}Iteration 4:   log pseudolikelihood = {res}-157.54586

{txt}Fitting full model:
Iteration 0:   log pseudolikelihood = {res}-157.54586

{txt}Weibull regression -- accelerated failure-time form 

No. of subjects      = {res}          78                {txt}Number of obs   ={res}       169
{txt}No. of failures      = {res}          78
{txt}Time at risk         = {res}     1226.47
{col 52}{help j_robustsingular##|_new:Wald chi2(0)}{txt}{col 68}={res}         .
{txt}Log pseudolikelihood =   {res}-157.54586                {txt}Prob > chi2     ={res}         .

{txt}{ralign 78:(Std. Err. adjusted for {res:78} clusters in warnum)}
{col 1}{text}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 14}{text}{c |}{col 26}    Robust
{col 1}{text}          _t{col 14}{c |}      Coef.{col 26}   Std. Err.{col 37}      z{col 46}   P>|z|{col 55}    [95% Conf. Interval]
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} 2.386825{col 26}{space 2} .1928168{col 37}{space 1}   12.38{col 46}{space 3}0.000{col 55}{space 3} 2.008911{col 67}{space 3}  2.76474
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}       /ln_p{col 14}{c |}{result}{space 2}-.4643938{col 27}{space 1} .0699516{col 39}  -6.64{col 47}{space 2}0.000{col 55}{space 3}-.6014965{col 67}{space 3}-.3272911
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 8}{hline 8}{hline 12}{hline 12}
{col 1}{text}           p{col 14}{c |}{result}{space 2}  .628516{col 27}{space 1} .0439657{col 55}{space 3}  .547991{col 67}{space 3} .7208738
{col 1}{text}         1/p{col 14}{c |}{result}{space 2} 1.591049{col 27}{space 1} .1112965{col 55}{space 3} 1.387205{col 67}{space 3} 1.824848
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}

{com}. outreg using one-per-year-predictions1.doc, nolabel replace se
{txt}(note: file one-per-year-predictions1.doc not found)

{com}. predict preddurnaiive
{txt}(option median time assumed; predicted median time)

{com}. 
. 
. *  Full model.  Here, do a robust estimation for new tables.
. streg oadm oada oadp opda rterrain  rterrstr  bofadj  summper sumpop  popratio qualrat  surpdiff  salscale  reprsum  demosum salscale  adis3010  nactors, dist(weibull) nohr time robust

         {txt}failure _d:  {res}end
   {txt}analysis time _t:  {res}time
                 {txt}id:  {res}warnum
{txt}note: salscale dropped because of collinearity

Fitting constant-only model:

Iteration 0:   log pseudolikelihood = {res}-175.66142
{txt}Iteration 1:   log pseudolikelihood = {res}-157.82696
{txt}Iteration 2:   log pseudolikelihood = {res}-157.54593
{txt}Iteration 3:   log pseudolikelihood = {res}-157.54586
{txt}Iteration 4:   log pseudolikelihood = {res}-157.54586

{txt}Fitting full model:

Iteration 0:{col 16}log pseudolikelihood = {res}-157.54586{txt}  
Iteration 1:{col 16}log pseudolikelihood = {res}-143.03908{txt}  
Iteration 2:{col 16}log pseudolikelihood = {res}-125.65393{txt}  
Iteration 3:{col 16}log pseudolikelihood = {res}-124.84729{txt}  
Iteration 4:{col 16}log pseudolikelihood = {res}-124.82762{txt}  
Iteration 5:{col 16}log pseudolikelihood = {res}-124.82754{txt}  
Iteration 6:{col 16}log pseudolikelihood = {res}-124.82754{txt}  

Weibull regression -- accelerated failure-time form 

No. of subjects      = {res}          78                {txt}Number of obs   ={res}       169
{txt}No. of failures      = {res}          78
{txt}Time at risk         = {res}     1226.47
                                                   {txt}Wald chi2({res}16{txt})   ={res}    465.39
{txt}Log pseudolikelihood =   {res}-124.82754                {txt}Prob > chi2     ={res}    0.0000

{txt}{ralign 78:(Std. Err. adjusted for {res:78} clusters in warnum)}
{col 1}{text}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 14}{text}{c |}{col 26}    Robust
{col 1}{text}          _t{col 14}{c |}      Coef.{col 26}   Std. Err.{col 37}      z{col 46}   P>|z|{col 55}    [95% Conf. Interval]
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}        oadm{col 14}{c |}{result}{space 2} 2.759301{col 26}{space 2} .5065146{col 37}{space 1}    5.45{col 46}{space 3}0.000{col 55}{space 3} 1.766551{col 67}{space 3} 3.752052
{col 1}{text}        oada{col 14}{c |}{result}{space 2} 3.203406{col 26}{space 2} .4955839{col 37}{space 1}    6.46{col 46}{space 3}0.000{col 55}{space 3} 2.232079{col 67}{space 3} 4.174732
{col 1}{text}        oadp{col 14}{c |}{result}{space 2} 6.285461{col 26}{space 2} 1.417003{col 37}{space 1}    4.44{col 46}{space 3}0.000{col 55}{space 3} 3.508185{col 67}{space 3} 9.062736
{col 1}{text}        opda{col 14}{c |}{result}{space 2} 10.99144{col 26}{space 2} 2.323257{col 37}{space 1}    4.73{col 46}{space 3}0.000{col 55}{space 3} 6.437942{col 67}{space 3} 15.54494
{col 1}{text}    rterrain{col 14}{c |}{result}{space 2} 5.062084{col 26}{space 2} 2.865337{col 37}{space 1}    1.77{col 46}{space 3}0.077{col 55}{space 3}-.5538729{col 67}{space 3} 10.67804
{col 1}{text}    rterrstr{col 14}{c |}{result}{space 2}-1.703234{col 26}{space 2}  .745967{col 37}{space 1}   -2.28{col 46}{space 3}0.022{col 55}{space 3}-3.165302{col 67}{space 3}-.2411653
{col 1}{text}      bofadj{col 14}{c |}{result}{space 2} -4.75618{col 26}{space 2} 1.224976{col 37}{space 1}   -3.88{col 46}{space 3}0.000{col 55}{space 3}-7.157088{col 67}{space 3}-2.355271
{col 1}{text}     summper{col 14}{c |}{result}{space 2} .1239886{col 26}{space 2} .0373439{col 37}{space 1}    3.32{col 46}{space 3}0.001{col 55}{space 3} .0507959{col 67}{space 3} .1971813
{col 1}{text}      sumpop{col 14}{c |}{result}{space 2} .7067902{col 26}{space 2} .5397011{col 37}{space 1}    1.31{col 46}{space 3}0.190{col 55}{space 3}-.3510045{col 67}{space 3} 1.764585
{col 1}{text}    popratio{col 14}{c |}{result}{space 2} .0069696{col 26}{space 2} .0118649{col 37}{space 1}    0.59{col 46}{space 3}0.557{col 55}{space 3}-.0162853{col 67}{space 3} .0302244
{col 1}{text}     qualrat{col 14}{c |}{result}{space 2} .0101149{col 26}{space 2} .0094807{col 37}{space 1}    1.07{col 46}{space 3}0.286{col 55}{space 3} -.008467{col 67}{space 3} .0286968
{col 1}{text}    surpdiff{col 14}{c |}{result}{space 2}-.2032023{col 26}{space 2}  .523505{col 37}{space 1}   -0.39{col 46}{space 3}0.698{col 55}{space 3}-1.229253{col 67}{space 3} .8228485
{col 1}{text}    salscale{col 14}{c |}{result}{space 2} .4195679{col 26}{space 2} .2013741{col 37}{space 1}    2.08{col 46}{space 3}0.037{col 55}{space 3}  .024882{col 67}{space 3} .8142538
{col 1}{text}     reprsum{col 14}{c |}{result}{space 2} -.199923{col 26}{space 2}  .110883{col 37}{space 1}   -1.80{col 46}{space 3}0.071{col 55}{space 3}-.4172496{col 67}{space 3} .0174037
{col 1}{text}     demosum{col 14}{c |}{result}{space 2}-.1002182{col 26}{space 2} .0527846{col 37}{space 1}   -1.90{col 46}{space 3}0.058{col 55}{space 3} -.203674{col 67}{space 3} .0032377
{col 1}{text}    adis3010{col 14}{c |}{result}{space 2} -.008049{col 26}{space 2} .0534474{col 37}{space 1}   -0.15{col 46}{space 3}0.880{col 55}{space 3} -.112804{col 67}{space 3}  .096706
{col 1}{text}     nactors{col 14}{c |}{result}{space 2}-.1898279{col 26}{space 2} .0921981{col 37}{space 1}   -2.06{col 46}{space 3}0.040{col 55}{space 3}-.3705329{col 67}{space 3}-.0091229
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} 2.251671{col 26}{space 2} 1.164695{col 37}{space 1}    1.93{col 46}{space 3}0.053{col 55}{space 3} -.031089{col 67}{space 3}  4.53443
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}       /ln_p{col 14}{c |}{result}{space 2}-.0357793{col 27}{space 1} .0850342{col 39}  -0.42{col 47}{space 2}0.674{col 55}{space 3}-.2024432{col 67}{space 3} .1308846
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 8}{hline 8}{hline 12}{hline 12}
{col 1}{text}           p{col 14}{c |}{result}{space 2} .9648532{col 27}{space 1} .0820455{col 55}{space 3} .8167329{col 67}{space 3} 1.139836
{col 1}{text}         1/p{col 14}{c |}{result}{space 2} 1.036427{col 27}{space 1} .0881317{col 55}{space 3}  .877319{col 67}{space 3} 1.224391
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}

{com}. outreg using one-per-year-predictions2.doc, nolabel replace se
{txt}(note: file one-per-year-predictions2.doc not found)

{com}. predict preddurfull
{txt}(option median time assumed; predicted median time)

{com}. 
. 
. * Before doing any summaries, need to keep only the end year predictions so that error comparison can be 
. * only for the final end of war.
. keep if end==1
{txt}(91 observations deleted)

{com}. * Final length is now the time of each of these observations
. gen length=time
{txt}
{com}. 
. 
. egen meanlength=mean(length)
{txt}
{com}. egen medlength=median(length)
{txt}
{com}. sum length medlength

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
      length {c |}{res}        78    15.72397    24.75778        .03        121
   {txt}medlength {c |}{res}        78           5           0          5          5
{txt}
{com}. * mean length is 15.724
. * median length is 5
. * pred length from naiive (constant only) model on the TVC model is 6.071
. 
. gen fullerror=preddurfull-length
{txt}
{com}. gen naierror=preddurnaiive-length
{txt}
{com}. gen absfullerr=abs(fullerror)
{txt}
{com}. gen absnaierr=abs(naierror)
{txt}
{com}. egen totabsfullerr = sum(absfullerr)
{txt}
{com}. egen totabsnaierr = sum(absnaierr)
{txt}
{com}. 
. egen meanabsfullerr = mean(absfullerr)
{txt}
{com}. egen medabsfullerr = median(absfullerr)
{txt}
{com}. egen meanabsnaierr = mean(absnaierr)
{txt}
{com}. egen medabsnaierr = median(absnaierr)
{txt}
{com}. 
. label var meanabsfullerr "Mean absolute errors, full model"
{txt}
{com}. label var medabsfullerr "Median absolute errors, full model"
{txt}
{com}. label var meanabsnaierr "Mean of absolute errors, naiive model"
{txt}
{com}. label var medabsnaierr "Median of absolute errors, naiive model"
{txt}
{com}. 
. * summarize errors to get mean of errors, absolute errors, and sd.
. sum fullerror naierror absfullerr absnaierr

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
   fullerror {c |}{res}        78   -3.155797      19.928  -58.58281    91.0107
    {txt}naierror {c |}{res}        78   -9.651991    24.75778   -114.928   6.041983
  {txt}absfullerr {c |}{res}        78    11.04044    16.84456   .0085859    91.0107
   {txt}absnaierr {c |}{res}        78    13.82925    22.66245   .0719833    114.928
{txt}
{com}. sum meanabsfullerr medabsfullerr meanabsnaierr medabsnaierr

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
meanabsful~r {c |}{res}        78    11.04045           0   11.04045   11.04045
{txt}medabsfull~r {c |}{res}        78    4.495557           0   4.495557   4.495557
{txt}meanabsnai~r {c |}{res}        78    13.82925           0   13.82925   13.82925
{txt}medabsnaierr {c |}{res}        78    5.071983           0   5.071983   5.071983
{txt}
{com}. 
. 
. 
. * Now compute error as % of length.  It turns out this is not a great measure, because 
. * error can be greater than length.  Then, 2.5 (e.g.) means the error is 2.5x the length.
. * This may not be a good measure then, because you are automatically very wrong for the shortest wars.
. * e.g. in a 1 month war, a 6 month error leads to a 600% (bad) error, while in a 12 month war, that 
. * same error is a 50% error.
. * BUT, our model still does much better than the naiive model here.
. gen pctactabsfullerr = absfullerr/length
{txt}
{com}. gen pctactabsnaierr = absnaierr/length
{txt}
{com}. egen meanpctactabsfullerr = mean(pctactabsfullerr )
{txt}
{com}. egen meanpctactabsnaierr = mean(pctactabsnaierr )
{txt}
{com}. label var meanpctactabsfullerr "Mean of absolute errors, full model, as pct of length"
{txt}
{com}. label var meanpctactabsnaierr "Mean absolute errors, naiive model, as pct of length"
{txt}
{com}. 
. * Look at error as pct of length.
. sum pctactabsfullerr pctactabsnaierr meanpctactabsfullerr meanpctactabsnaierr 

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
pctactabsf~r {c |}{res}        78    3.261757    8.999269   .0429296   67.85305
{txt}pctactabsn~r {c |}{res}        78     9.97074    33.61596   .0119972   201.3994
{txt}meanpct~lerr {c |}{res}        78    3.261757           0   3.261757   3.261757
{txt}meanpct~ierr {c |}{res}        78     9.97074           0    9.97074    9.97074
{txt}
{com}. 
. 
. 
. * Now generate total errors from naiive model, total errors from our model, and can do PRE.
. * PRE:  (error1 - error2) / error1
. egen totalnaiiveerrors=sum(absnaierr)
{txt}
{com}. egen totalfullerrors=sum(absfullerr)
{txt}
{com}. gen PRE=(totalnaiiveerrors - totalfullerrors)/totalnaiiveerrors
{txt}
{com}. label var totalnaiiveerrors "Total of absolute errors, naiive model"
{txt}
{com}. label var totalfullerrors "Total of absolute errors, full model"
{txt}
{com}. label var PRE "Prop. reduction in total errors"
{txt}
{com}. 
. sum totalnaiiveerrors totalfullerrors PRE

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
totalnaiiv~s {c |}{res}        78    1078.682           0   1078.682   1078.682
{txt}totalfulle~s {c |}{res}        78    861.1547           0   861.1547   861.1547
         {txt}PRE {c |}{res}        78    .2016601           0   .2016601   .2016601
{txt}
{com}. 
. 
. * To see what cases are right/wrong, can list cases and errors
. * sort fullerror
. * list warnum year  lastyear ccode1 ccode2 length preddurfull fullerror naierror
. 
. 
. 
. *********************************************************************
. ** Commands to do predicted values for Model 1 (Limited TVC model) **
. *********************************************************************
. 
. clear
{txt}
{com}. 
. insheet using one_per_year.csv
{txt}(32 vars, 169 obs)

{com}. 
. gen end=0
{txt}
{com}. replace end=1 if year==lastyear
{txt}(78 real changes made)

{com}. 
. stset time, id(warnum) fail(end)

                {txt}id:  {res}warnum
     {txt}failure event:  {res}end != 0 & end < .
{txt}obs. time interval:  {res}(time[_n-1], time]
{txt} exit on or before:  {res}failure

{txt}{hline 78}
{res}      169{txt}  total obs.
{res}        0{txt}  exclusions
{hline 78}
{res}      169{txt}  obs. remaining, representing
{res}       78{txt}  subjects
{res}       78{txt}  failures in single failure-per-subject data
{res}  1226.47{txt}  total analysis time at risk, at risk from t = {res}        0
                             {txt}earliest observed entry t = {res}        0
                                  {txt}last observed exit t = {res}      121
{txt}
{com}. 
. *  Here, do a robust estimation for new tables.
. streg popratio nactors year, dist(weibull) nohr time robust

         {txt}failure _d:  {res}end
   {txt}analysis time _t:  {res}time
                 {txt}id:  {res}warnum

{txt}Fitting constant-only model:

Iteration 0:   log pseudolikelihood = {res}-175.66142
{txt}Iteration 1:   log pseudolikelihood = {res}-157.82696
{txt}Iteration 2:   log pseudolikelihood = {res}-157.54593
{txt}Iteration 3:   log pseudolikelihood = {res}-157.54586
{txt}Iteration 4:   log pseudolikelihood = {res}-157.54586

{txt}Fitting full model:

Iteration 0:{col 16}log pseudolikelihood = {res}-157.54586{txt}  
Iteration 1:{col 16}log pseudolikelihood = {res}-156.44747{txt}  
Iteration 2:{col 16}log pseudolikelihood = {res}-156.38077{txt}  
Iteration 3:{col 16}log pseudolikelihood = {res}-156.38058{txt}  
Iteration 4:{col 16}log pseudolikelihood = {res}-156.38058{txt}  

Weibull regression -- accelerated failure-time form 

No. of subjects      = {res}          78                {txt}Number of obs   ={res}       169
{txt}No. of failures      = {res}          78
{txt}Time at risk         = {res}     1226.47
                                                   {txt}Wald chi2({res}3{txt})    ={res}      3.96
{txt}Log pseudolikelihood =   {res}-156.38058                {txt}Prob > chi2     ={res}    0.2657

{txt}{ralign 78:(Std. Err. adjusted for {res:78} clusters in warnum)}
{col 1}{text}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 14}{text}{c |}{col 26}    Robust
{col 1}{text}          _t{col 14}{c |}      Coef.{col 26}   Std. Err.{col 37}      z{col 46}   P>|z|{col 55}    [95% Conf. Interval]
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}    popratio{col 14}{c |}{result}{space 2}-.0237701{col 26}{space 2}   .01352{col 37}{space 1}   -1.76{col 46}{space 3}0.079{col 55}{space 3}-.0502688{col 67}{space 3} .0027287
{col 1}{text}     nactors{col 14}{c |}{result}{space 2} .0638854{col 26}{space 2} .0772365{col 37}{space 1}    0.83{col 46}{space 3}0.408{col 55}{space 3}-.0874954{col 67}{space 3} .2152662
{col 1}{text}        year{col 14}{c |}{result}{space 2} -.000914{col 26}{space 2}  .004446{col 37}{space 1}   -0.21{col 46}{space 3}0.837{col 55}{space 3} -.009628{col 67}{space 3} .0078001
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} 4.143468{col 26}{space 2} 8.420648{col 37}{space 1}    0.49{col 46}{space 3}0.623{col 55}{space 3} -12.3607{col 67}{space 3} 20.64763
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}       /ln_p{col 14}{c |}{result}{space 2}-.4639892{col 27}{space 1} .0725964{col 39}  -6.39{col 47}{space 2}0.000{col 55}{space 3}-.6062756{col 67}{space 3}-.3217028
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 8}{hline 8}{hline 12}{hline 12}
{col 1}{text}           p{col 14}{c |}{result}{space 2} .6287703{col 27}{space 1} .0456465{col 55}{space 3} .5453783{col 67}{space 3} .7249136
{col 1}{text}         1/p{col 14}{c |}{result}{space 2} 1.590406{col 27}{space 1} .1154578{col 55}{space 3} 1.379475{col 67}{space 3}  1.83359
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}

{com}. outreg using one-per-year-predictions3.doc, nolabel replace se
{txt}(note: file one-per-year-predictions3.doc not found)

{com}. predict preddurfull
{txt}(option median time assumed; predicted median time)

{com}. 
. streg, dist(weibull) nohr time  robust

         {txt}failure _d:  {res}end
   {txt}analysis time _t:  {res}time
                 {txt}id:  {res}warnum

{txt}Fitting constant-only model:

Iteration 0:   log pseudolikelihood = {res}-175.66142
{txt}Iteration 1:   log pseudolikelihood = {res}-157.82696
{txt}Iteration 2:   log pseudolikelihood = {res}-157.54593
{txt}Iteration 3:   log pseudolikelihood = {res}-157.54586
{txt}Iteration 4:   log pseudolikelihood = {res}-157.54586

{txt}Fitting full model:
Iteration 0:   log pseudolikelihood = {res}-157.54586

{txt}Weibull regression -- accelerated failure-time form 

No. of subjects      = {res}          78                {txt}Number of obs   ={res}       169
{txt}No. of failures      = {res}          78
{txt}Time at risk         = {res}     1226.47
{col 52}{help j_robustsingular##|_new:Wald chi2(0)}{txt}{col 68}={res}         .
{txt}Log pseudolikelihood =   {res}-157.54586                {txt}Prob > chi2     ={res}         .

{txt}{ralign 78:(Std. Err. adjusted for {res:78} clusters in warnum)}
{col 1}{text}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 14}{text}{c |}{col 26}    Robust
{col 1}{text}          _t{col 14}{c |}      Coef.{col 26}   Std. Err.{col 37}      z{col 46}   P>|z|{col 55}    [95% Conf. Interval]
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} 2.386825{col 26}{space 2} .1928168{col 37}{space 1}   12.38{col 46}{space 3}0.000{col 55}{space 3} 2.008911{col 67}{space 3}  2.76474
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}       /ln_p{col 14}{c |}{result}{space 2}-.4643938{col 27}{space 1} .0699516{col 39}  -6.64{col 47}{space 2}0.000{col 55}{space 3}-.6014965{col 67}{space 3}-.3272911
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 8}{hline 8}{hline 12}{hline 12}
{col 1}{text}           p{col 14}{c |}{result}{space 2}  .628516{col 27}{space 1} .0439657{col 55}{space 3}  .547991{col 67}{space 3} .7208738
{col 1}{text}         1/p{col 14}{c |}{result}{space 2} 1.591049{col 27}{space 1} .1112965{col 55}{space 3} 1.387205{col 67}{space 3} 1.824848
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}

{com}. predict preddurnaiive
{txt}(option median time assumed; predicted median time)

{com}. 
. 
. * Before doing any summaries, need to keep only the end year predictions so that error comparison can be 
. * only for the final end of war.
. keep if end==1
{txt}(91 observations deleted)

{com}. * Final length is now the time of each of these observations
. gen length=time
{txt}
{com}. 
. 
. egen meanlength=mean(length)
{txt}
{com}. egen medlength=median(length)
{txt}
{com}. sum length medlength

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
      length {c |}{res}        78    15.72397    24.75778        .03        121
   {txt}medlength {c |}{res}        78           5           0          5          5
{txt}
{com}. * mean length is 15.724
. * median length is 5
. * pred length from naiive (constant only) model on the TVC model is 6.071
. 
. gen fullerror=preddurfull-length
{txt}
{com}. gen naierror=preddurnaiive-length
{txt}
{com}. gen absfullerr=abs(fullerror)
{txt}
{com}. gen absnaierr=abs(naierror)
{txt}
{com}. egen totabsfullerr = sum(absfullerr)
{txt}
{com}. egen totabsnaierr = sum(absnaierr)
{txt}
{com}. 
. egen meanabsfullerr = mean(absfullerr)
{txt}
{com}. egen medabsfullerr = median(absfullerr)
{txt}
{com}. egen meanabsnaierr = mean(absnaierr)
{txt}
{com}. egen medabsnaierr = median(absnaierr)
{txt}
{com}. 
. label var meanabsfullerr "Mean absolute errors, full model"
{txt}
{com}. label var medabsfullerr "Median absolute errors, full model"
{txt}
{com}. label var meanabsnaierr "Mean of absolute errors, naiive model"
{txt}
{com}. label var medabsnaierr "Median of absolute errors, naiive model"
{txt}
{com}. 
. * summarize errors to get mean of errors, absolute errors, and sd.
. sum fullerror naierror absfullerr absnaierr

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
   fullerror {c |}{res}        78   -9.547308    24.76758  -115.4979     11.592
    {txt}naierror {c |}{res}        78   -9.651991    24.75778   -114.928   6.041983
  {txt}absfullerr {c |}{res}        78     13.7217    22.69444   .1703415   115.4979
   {txt}absnaierr {c |}{res}        78    13.82925    22.66245   .0719833    114.928
{txt}
{com}. sum meanabsfullerr medabsfullerr meanabsnaierr medabsnaierr

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
meanabsful~r {c |}{res}        78     13.7217           0    13.7217    13.7217
{txt}medabsfull~r {c |}{res}        78    4.810807           0   4.810807   4.810807
{txt}meanabsnai~r {c |}{res}        78    13.82925           0   13.82925   13.82925
{txt}medabsnaierr {c |}{res}        78    5.071983           0   5.071983   5.071983
{txt}
{com}. 
. 
. 
. * Now compute error as % of length.  It turns out this is not a great measure, because 
. * error can be greater than length.  Then, 2.5 (e.g.) means the error is 2.5x the length.
. * This may not be a good measure then, because you are automatically very wrong for the shortest wars.
. * e.g. in a 1 month war, a 6 month error leads to a 600% (bad) error, while in a 12 month war, that 
. * same error is a 50% error.
. * BUT, our model still does much better than the naiive model here.
. gen pctactabsfullerr = absfullerr/length
{txt}
{com}. gen pctactabsnaierr = absnaierr/length
{txt}
{com}. egen meanpctactabsfullerr = mean(pctactabsfullerr )
{txt}
{com}. egen meanpctactabsnaierr = mean(pctactabsnaierr )
{txt}
{com}. label var meanpctactabsfullerr "Mean of absolute errors, full model, as pct of length"
{txt}
{com}. label var meanpctactabsnaierr "Mean absolute errors, naiive model, as pct of length"
{txt}
{com}. 
. * Look at error as pct of length.
. sum pctactabsfullerr pctactabsnaierr meanpctactabsfullerr meanpctactabsnaierr 

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
pctactabsf~r {c |}{res}        78    8.794721    28.88655   .0283902   202.8285
{txt}pctactabsn~r {c |}{res}        78     9.97074    33.61596   .0119972   201.3994
{txt}meanpct~lerr {c |}{res}        78    8.794721           0   8.794721   8.794721
{txt}meanpct~ierr {c |}{res}        78     9.97074           0    9.97074    9.97074
{txt}
{com}. 
. 
. 
. * Now generate total errors from naiive model, total errors from our model, and can do PRE.
. * PRE:  (error1 - error2) / error1
. egen totalnaiiveerrors=sum(absnaierr)
{txt}
{com}. egen totalfullerrors=sum(absfullerr)
{txt}
{com}. gen PRE=(totalnaiiveerrors - totalfullerrors)/totalnaiiveerrors
{txt}
{com}. label var totalnaiiveerrors "Total of absolute errors, naiive model"
{txt}
{com}. label var totalfullerrors "Total of absolute errors, full model"
{txt}
{com}. label var PRE "Prop. reduction in total errors"
{txt}
{com}. 
. sum totalnaiiveerrors totalfullerrors PRE

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
totalnaiiv~s {c |}{res}        78    1078.682           0   1078.682   1078.682
{txt}totalfulle~s {c |}{res}        78    1070.293           0   1070.293   1070.293
         {txt}PRE {c |}{res}        78    .0077771           0   .0077771   .0077771
{txt}
{com}. 
. 
. 
. 
. *************************************************************************
. ** Commands to do predicted values for Model 2 (Realpolitik TVC model) **
. *************************************************************************
. 
. clear
{txt}
{com}. 
. insheet using one_per_year.csv
{txt}(32 vars, 169 obs)

{com}. 
. gen end=0
{txt}
{com}. replace end=1 if year==lastyear
{txt}(78 real changes made)

{com}. 
. stset time, id(warnum) fail(end)

                {txt}id:  {res}warnum
     {txt}failure event:  {res}end != 0 & end < .
{txt}obs. time interval:  {res}(time[_n-1], time]
{txt} exit on or before:  {res}failure

{txt}{hline 78}
{res}      169{txt}  total obs.
{res}        0{txt}  exclusions
{hline 78}
{res}      169{txt}  obs. remaining, representing
{res}       78{txt}  subjects
{res}       78{txt}  failures in single failure-per-subject data
{res}  1226.47{txt}  total analysis time at risk, at risk from t = {res}        0
                             {txt}earliest observed entry t = {res}        0
                                  {txt}last observed exit t = {res}      121
{txt}
{com}. 
. *  Here, do a robust estimation for new tables.
. streg oadm oada oadp opda rterrain  rterrstr  bofadj  summper sumpop  popratio qualrat  surpdiff  salscale, dist(weibull) nohr time robust

         {txt}failure _d:  {res}end
   {txt}analysis time _t:  {res}time
                 {txt}id:  {res}warnum

{txt}Fitting constant-only model:

Iteration 0:   log pseudolikelihood = {res}-175.66142
{txt}Iteration 1:   log pseudolikelihood = {res}-157.82696
{txt}Iteration 2:   log pseudolikelihood = {res}-157.54593
{txt}Iteration 3:   log pseudolikelihood = {res}-157.54586
{txt}Iteration 4:   log pseudolikelihood = {res}-157.54586

{txt}Fitting full model:

Iteration 0:{col 16}log pseudolikelihood = {res}-157.54586{txt}  
Iteration 1:{col 16}log pseudolikelihood = {res}-141.40374{txt}  
Iteration 2:{col 16}log pseudolikelihood = {res}-127.99452{txt}  
Iteration 3:{col 16}log pseudolikelihood = {res}-127.51146{txt}  
Iteration 4:{col 16}log pseudolikelihood = {res}-127.48619{txt}  
Iteration 5:{col 16}log pseudolikelihood = {res}-127.48609{txt}  
Iteration 6:{col 16}log pseudolikelihood = {res}-127.48609{txt}  

Weibull regression -- accelerated failure-time form 

No. of subjects      = {res}          78                {txt}Number of obs   ={res}       169
{txt}No. of failures      = {res}          78
{txt}Time at risk         = {res}     1226.47
                                                   {txt}Wald chi2({res}12{txt})   ={res}    753.56
{txt}Log pseudolikelihood =   {res}-127.48609                {txt}Prob > chi2     ={res}    0.0000

{txt}{ralign 78:(Std. Err. adjusted for {res:78} clusters in warnum)}
{col 1}{text}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 14}{text}{c |}{col 26}    Robust
{col 1}{text}          _t{col 14}{c |}      Coef.{col 26}   Std. Err.{col 37}      z{col 46}   P>|z|{col 55}    [95% Conf. Interval]
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}        oadm{col 14}{c |}{result}{space 2} 2.484015{col 26}{space 2} .5312315{col 37}{space 1}    4.68{col 46}{space 3}0.000{col 55}{space 3} 1.442821{col 67}{space 3}  3.52521
{col 1}{text}        oada{col 14}{c |}{result}{space 2} 3.253752{col 26}{space 2} .5096053{col 37}{space 1}    6.38{col 46}{space 3}0.000{col 55}{space 3} 2.254944{col 67}{space 3}  4.25256
{col 1}{text}        oadp{col 14}{c |}{result}{space 2} 7.016061{col 26}{space 2} 1.417631{col 37}{space 1}    4.95{col 46}{space 3}0.000{col 55}{space 3} 4.237554{col 67}{space 3} 9.794567
{col 1}{text}        opda{col 14}{c |}{result}{space 2} 11.59573{col 26}{space 2} 2.453858{col 37}{space 1}    4.73{col 46}{space 3}0.000{col 55}{space 3} 6.786257{col 67}{space 3}  16.4052
{col 1}{text}    rterrain{col 14}{c |}{result}{space 2}  6.61847{col 26}{space 2} 2.971461{col 37}{space 1}    2.23{col 46}{space 3}0.026{col 55}{space 3} .7945134{col 67}{space 3} 12.44243
{col 1}{text}    rterrstr{col 14}{c |}{result}{space 2}-2.025752{col 26}{space 2} .7846561{col 37}{space 1}   -2.58{col 46}{space 3}0.010{col 55}{space 3} -3.56365{col 67}{space 3}-.4878543
{col 1}{text}      bofadj{col 14}{c |}{result}{space 2}-5.026929{col 26}{space 2}  1.27641{col 37}{space 1}   -3.94{col 46}{space 3}0.000{col 55}{space 3}-7.528647{col 67}{space 3}-2.525212
{col 1}{text}     summper{col 14}{c |}{result}{space 2}  .000061{col 26}{space 2} .0000279{col 37}{space 1}    2.19{col 46}{space 3}0.029{col 55}{space 3} 6.38e-06{col 67}{space 3} .0001157
{col 1}{text}      sumpop{col 14}{c |}{result}{space 2} 7.51e-07{col 26}{space 2} 6.25e-07{col 37}{space 1}    1.20{col 46}{space 3}0.230{col 55}{space 3}-4.74e-07{col 67}{space 3} 1.98e-06
{col 1}{text}    popratio{col 14}{c |}{result}{space 2} .0005608{col 26}{space 2} .0110773{col 37}{space 1}    0.05{col 46}{space 3}0.960{col 55}{space 3}-.0211504{col 67}{space 3}  .022272
{col 1}{text}     qualrat{col 14}{c |}{result}{space 2}  .013007{col 26}{space 2} .0114182{col 37}{space 1}    1.14{col 46}{space 3}0.255{col 55}{space 3}-.0093722{col 67}{space 3} .0353862
{col 1}{text}    surpdiff{col 14}{c |}{result}{space 2}-.1232752{col 26}{space 2} .6509602{col 37}{space 1}   -0.19{col 46}{space 3}0.850{col 55}{space 3}-1.399134{col 67}{space 3} 1.152583
{col 1}{text}    salscale{col 14}{c |}{result}{space 2} .3363409{col 26}{space 2} .2312726{col 37}{space 1}    1.45{col 46}{space 3}0.146{col 55}{space 3}-.1169449{col 67}{space 3} .7896268
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} 2.462208{col 26}{space 2} 1.104358{col 37}{space 1}    2.23{col 46}{space 3}0.026{col 55}{space 3} .2977055{col 67}{space 3} 4.626711
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}       /ln_p{col 14}{c |}{result}{space 2}-.0975137{col 27}{space 1} .0810607{col 39}  -1.20{col 47}{space 2}0.229{col 55}{space 3}-.2563898{col 67}{space 3} .0613623
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 8}{hline 8}{hline 12}{hline 12}
{col 1}{text}           p{col 14}{c |}{result}{space 2} .9070899{col 27}{space 1} .0735293{col 55}{space 3} .7738403{col 67}{space 3} 1.063284
{col 1}{text}         1/p{col 14}{c |}{result}{space 2} 1.102427{col 27}{space 1} .0893635{col 55}{space 3} .9404824{col 67}{space 3} 1.292256
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}

{com}. outreg using one-per-year-predictions4.doc, nolabel replace se
{txt}(note: file one-per-year-predictions4.doc not found)

{com}. predict preddurfull
{txt}(option median time assumed; predicted median time)

{com}. 
. streg, dist(weibull) nohr time  robust

         {txt}failure _d:  {res}end
   {txt}analysis time _t:  {res}time
                 {txt}id:  {res}warnum

{txt}Fitting constant-only model:

Iteration 0:   log pseudolikelihood = {res}-175.66142
{txt}Iteration 1:   log pseudolikelihood = {res}-157.82696
{txt}Iteration 2:   log pseudolikelihood = {res}-157.54593
{txt}Iteration 3:   log pseudolikelihood = {res}-157.54586
{txt}Iteration 4:   log pseudolikelihood = {res}-157.54586

{txt}Fitting full model:
Iteration 0:   log pseudolikelihood = {res}-157.54586

{txt}Weibull regression -- accelerated failure-time form 

No. of subjects      = {res}          78                {txt}Number of obs   ={res}       169
{txt}No. of failures      = {res}          78
{txt}Time at risk         = {res}     1226.47
{col 52}{help j_robustsingular##|_new:Wald chi2(0)}{txt}{col 68}={res}         .
{txt}Log pseudolikelihood =   {res}-157.54586                {txt}Prob > chi2     ={res}         .

{txt}{ralign 78:(Std. Err. adjusted for {res:78} clusters in warnum)}
{col 1}{text}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 14}{text}{c |}{col 26}    Robust
{col 1}{text}          _t{col 14}{c |}      Coef.{col 26}   Std. Err.{col 37}      z{col 46}   P>|z|{col 55}    [95% Conf. Interval]
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} 2.386825{col 26}{space 2} .1928168{col 37}{space 1}   12.38{col 46}{space 3}0.000{col 55}{space 3} 2.008911{col 67}{space 3}  2.76474
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}       /ln_p{col 14}{c |}{result}{space 2}-.4643938{col 27}{space 1} .0699516{col 39}  -6.64{col 47}{space 2}0.000{col 55}{space 3}-.6014965{col 67}{space 3}-.3272911
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 8}{hline 8}{hline 12}{hline 12}
{col 1}{text}           p{col 14}{c |}{result}{space 2}  .628516{col 27}{space 1} .0439657{col 55}{space 3}  .547991{col 67}{space 3} .7208738
{col 1}{text}         1/p{col 14}{c |}{result}{space 2} 1.591049{col 27}{space 1} .1112965{col 55}{space 3} 1.387205{col 67}{space 3} 1.824848
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}

{com}. predict preddurnaiive
{txt}(option median time assumed; predicted median time)

{com}. 
. * Before doing any summaries, need to keep only the end year predictions so that error comparison can be 
. * only for the final end of war.
. keep if end==1
{txt}(91 observations deleted)

{com}. * Final length is now the time of each of these observations
. gen length=time
{txt}
{com}. 
. 
. egen meanlength=mean(length)
{txt}
{com}. egen medlength=median(length)
{txt}
{com}. sum length medlength

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
      length {c |}{res}        78    15.72397    24.75778        .03        121
   {txt}medlength {c |}{res}        78           5           0          5          5
{txt}
{com}. * mean length is 15.724
. * median length is 5
. * pred length from naiive (constant only) model on the TVC model is 6.071
. 
. gen fullerror=preddurfull-length
{txt}
{com}. gen naierror=preddurnaiive-length
{txt}
{com}. gen absfullerr=abs(fullerror)
{txt}
{com}. gen absnaierr=abs(naierror)
{txt}
{com}. egen totabsfullerr = sum(absfullerr)
{txt}
{com}. egen totabsnaierr = sum(absnaierr)
{txt}
{com}. 
. egen meanabsfullerr = mean(absfullerr)
{txt}
{com}. egen medabsfullerr = median(absfullerr)
{txt}
{com}. egen meanabsnaierr = mean(absnaierr)
{txt}
{com}. egen medabsnaierr = median(absnaierr)
{txt}
{com}. 
. label var meanabsfullerr "Mean absolute errors, full model"
{txt}
{com}. label var medabsfullerr "Median absolute errors, full model"
{txt}
{com}. label var meanabsnaierr "Mean of absolute errors, naiive model"
{txt}
{com}. label var medabsnaierr "Median of absolute errors, naiive model"
{txt}
{com}. 
. * summarize errors to get mean of errors, absolute errors, and sd.
. sum fullerror naierror absfullerr absnaierr

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
   fullerror {c |}{res}        78   -3.086466    21.44965  -69.91721   81.91186
    {txt}naierror {c |}{res}        78   -9.651991    24.75778   -114.928   6.041983
  {txt}absfullerr {c |}{res}        78    11.94401    18.03401   .0130191   81.91186
   {txt}absnaierr {c |}{res}        78    13.82925    22.66245   .0719833    114.928
{txt}
{com}. sum meanabsfullerr medabsfullerr meanabsnaierr medabsnaierr

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
meanabsful~r {c |}{res}        78    11.94401           0   11.94401   11.94401
{txt}medabsfull~r {c |}{res}        78      4.6527           0     4.6527     4.6527
{txt}meanabsnai~r {c |}{res}        78    13.82925           0   13.82925   13.82925
{txt}medabsnaierr {c |}{res}        78    5.071983           0   5.071983   5.071983
{txt}
{com}. 
. 
. 
. * Now compute error as % of length.  It turns out this is not a great measure, because 
. * error can be greater than length.  Then, 2.5 (e.g.) means the error is 2.5x the length.
. * This may not be a good measure then, because you are automatically very wrong for the shortest wars.
. * e.g. in a 1 month war, a 6 month error leads to a 600% (bad) error, while in a 12 month war, that 
. * same error is a 50% error.
. * BUT, our model still does much better than the naiive model here.
. gen pctactabsfullerr = absfullerr/length
{txt}
{com}. gen pctactabsnaierr = absnaierr/length
{txt}
{com}. egen meanpctactabsfullerr = mean(pctactabsfullerr )
{txt}
{com}. egen meanpctactabsnaierr = mean(pctactabsnaierr )
{txt}
{com}. label var meanpctactabsfullerr "Mean of absolute errors, full model, as pct of length"
{txt}
{com}. label var meanpctactabsnaierr "Mean absolute errors, naiive model, as pct of length"
{txt}
{com}. 
. * Look at error as pct of length.
. sum pctactabsfullerr pctactabsnaierr meanpctactabsfullerr meanpctactabsnaierr 

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
pctactabsf~r {c |}{res}        78     3.52986    8.481367   .0065095   55.28562
{txt}pctactabsn~r {c |}{res}        78     9.97074    33.61596   .0119972   201.3994
{txt}meanpct~lerr {c |}{res}        78     3.52986           0    3.52986    3.52986
{txt}meanpct~ierr {c |}{res}        78     9.97074           0    9.97074    9.97074
{txt}
{com}. 
. 
. 
. * Now generate total errors from naiive model, total errors from our model, and can do PRE.
. * PRE:  (error1 - error2) / error1
. egen totalnaiiveerrors=sum(absnaierr)
{txt}
{com}. egen totalfullerrors=sum(absfullerr)
{txt}
{com}. gen PRE=(totalnaiiveerrors - totalfullerrors)/totalnaiiveerrors
{txt}
{com}. label var totalnaiiveerrors "Total of absolute errors, naiive model"
{txt}
{com}. label var totalfullerrors "Total of absolute errors, full model"
{txt}
{com}. label var PRE "Prop. reduction in total errors"
{txt}
{com}. 
. sum totalnaiiveerrors totalfullerrors PRE

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
totalnaiiv~s {c |}{res}        78    1078.682           0   1078.682   1078.682
{txt}totalfulle~s {c |}{res}        78    931.6326           0   931.6326   931.6326
         {txt}PRE {c |}{res}        78     .136323           0    .136323    .136323
{txt}
{com}. 
. 
. 
. 
. ********************************************************************
. ** Commands to do predicted values for Model 3 (Regime TVC model) **
. ********************************************************************
. 
. clear
{txt}
{com}. 
. insheet using one_per_year.csv
{txt}(32 vars, 169 obs)

{com}. 
. gen end=0
{txt}
{com}. replace end=1 if year==lastyear
{txt}(78 real changes made)

{com}. 
. stset time, id(warnum) fail(end)

                {txt}id:  {res}warnum
     {txt}failure event:  {res}end != 0 & end < .
{txt}obs. time interval:  {res}(time[_n-1], time]
{txt} exit on or before:  {res}failure

{txt}{hline 78}
{res}      169{txt}  total obs.
{res}        0{txt}  exclusions
{hline 78}
{res}      169{txt}  obs. remaining, representing
{res}       78{txt}  subjects
{res}       78{txt}  failures in single failure-per-subject data
{res}  1226.47{txt}  total analysis time at risk, at risk from t = {res}        0
                             {txt}earliest observed entry t = {res}        0
                                  {txt}last observed exit t = {res}      121
{txt}
{com}. 
. *  Here, do a robust estimation for new tables.
. streg reprsum  demosum, dist(weibull) nohr time robust

         {txt}failure _d:  {res}end
   {txt}analysis time _t:  {res}time
                 {txt}id:  {res}warnum

{txt}Fitting constant-only model:

Iteration 0:   log pseudolikelihood = {res}-175.66142
{txt}Iteration 1:   log pseudolikelihood = {res}-157.82696
{txt}Iteration 2:   log pseudolikelihood = {res}-157.54593
{txt}Iteration 3:   log pseudolikelihood = {res}-157.54586
{txt}Iteration 4:   log pseudolikelihood = {res}-157.54586

{txt}Fitting full model:

Iteration 0:{col 16}log pseudolikelihood = {res}-157.54586{txt}  
Iteration 1:{col 16}log pseudolikelihood = {res}-155.87388{txt}  
Iteration 2:{col 16}log pseudolikelihood = {res} -155.8552{txt}  
Iteration 3:{col 16}log pseudolikelihood = {res} -155.8552{txt}  

Weibull regression -- accelerated failure-time form 

No. of subjects      = {res}          78                {txt}Number of obs   ={res}       169
{txt}No. of failures      = {res}          78
{txt}Time at risk         = {res}     1226.47
                                                   {txt}Wald chi2({res}2{txt})    ={res}      2.80
{txt}Log pseudolikelihood =   {res} -155.8552                {txt}Prob > chi2     ={res}    0.2463

{txt}{ralign 78:(Std. Err. adjusted for {res:78} clusters in warnum)}
{col 1}{text}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 14}{text}{c |}{col 26}    Robust
{col 1}{text}          _t{col 14}{c |}      Coef.{col 26}   Std. Err.{col 37}      z{col 46}   P>|z|{col 55}    [95% Conf. Interval]
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}     reprsum{col 14}{c |}{result}{space 2} .2811613{col 26}{space 2} .1802995{col 37}{space 1}    1.56{col 46}{space 3}0.119{col 55}{space 3}-.0722191{col 67}{space 3} .6345417
{col 1}{text}     demosum{col 14}{c |}{result}{space 2}-.1296592{col 26}{space 2} .0801118{col 37}{space 1}   -1.62{col 46}{space 3}0.106{col 55}{space 3}-.2866754{col 67}{space 3}  .027357
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} 1.746093{col 26}{space 2} .6337418{col 37}{space 1}    2.76{col 46}{space 3}0.006{col 55}{space 3} .5039816{col 67}{space 3} 2.988204
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}       /ln_p{col 14}{c |}{result}{space 2}-.4637246{col 27}{space 1} .0708929{col 39}  -6.54{col 47}{space 2}0.000{col 55}{space 3}-.6026721{col 67}{space 3}-.3247772
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 8}{hline 8}{hline 12}{hline 12}
{col 1}{text}           p{col 14}{c |}{result}{space 2} .6289367{col 27}{space 1} .0445871{col 55}{space 3} .5473471{col 67}{space 3} .7226884
{col 1}{text}         1/p{col 14}{c |}{result}{space 2} 1.589985{col 27}{space 1} .1127186{col 55}{space 3} 1.383722{col 67}{space 3} 1.826994
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}

{com}. outreg using one-per-year-predictions5.doc, nolabel replace se
{txt}(note: file one-per-year-predictions5.doc not found)

{com}. predict preddurfull
{txt}(option median time assumed; predicted median time)

{com}. 
. streg, dist(weibull) nohr time  robust

         {txt}failure _d:  {res}end
   {txt}analysis time _t:  {res}time
                 {txt}id:  {res}warnum

{txt}Fitting constant-only model:

Iteration 0:   log pseudolikelihood = {res}-175.66142
{txt}Iteration 1:   log pseudolikelihood = {res}-157.82696
{txt}Iteration 2:   log pseudolikelihood = {res}-157.54593
{txt}Iteration 3:   log pseudolikelihood = {res}-157.54586
{txt}Iteration 4:   log pseudolikelihood = {res}-157.54586

{txt}Fitting full model:
Iteration 0:   log pseudolikelihood = {res}-157.54586

{txt}Weibull regression -- accelerated failure-time form 

No. of subjects      = {res}          78                {txt}Number of obs   ={res}       169
{txt}No. of failures      = {res}          78
{txt}Time at risk         = {res}     1226.47
{col 52}{help j_robustsingular##|_new:Wald chi2(0)}{txt}{col 68}={res}         .
{txt}Log pseudolikelihood =   {res}-157.54586                {txt}Prob > chi2     ={res}         .

{txt}{ralign 78:(Std. Err. adjusted for {res:78} clusters in warnum)}
{col 1}{text}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 14}{text}{c |}{col 26}    Robust
{col 1}{text}          _t{col 14}{c |}      Coef.{col 26}   Std. Err.{col 37}      z{col 46}   P>|z|{col 55}    [95% Conf. Interval]
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} 2.386825{col 26}{space 2} .1928168{col 37}{space 1}   12.38{col 46}{space 3}0.000{col 55}{space 3} 2.008911{col 67}{space 3}  2.76474
{col 1}{text}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{col 1}{text}       /ln_p{col 14}{c |}{result}{space 2}-.4643938{col 27}{space 1} .0699516{col 39}  -6.64{col 47}{space 2}0.000{col 55}{space 3}-.6014965{col 67}{space 3}-.3272911
{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 8}{hline 8}{hline 12}{hline 12}
{col 1}{text}           p{col 14}{c |}{result}{space 2}  .628516{col 27}{space 1} .0439657{col 55}{space 3}  .547991{col 67}{space 3} .7208738
{col 1}{text}         1/p{col 14}{c |}{result}{space 2} 1.591049{col 27}{space 1} .1112965{col 55}{space 3} 1.387205{col 67}{space 3} 1.824848
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}

{com}. predict preddurnaiive
{txt}(option median time assumed; predicted median time)

{com}. 
. * Before doing any summaries, need to keep only the end year predictions so that error comparison can be 
. * only for the final end of war.
. keep if end==1
{txt}(91 observations deleted)

{com}. * Final length is now the time of each of these observations
. gen length=time
{txt}
{com}. 
. 
. egen meanlength=mean(length)
{txt}
{com}. egen medlength=median(length)
{txt}
{com}. sum length medlength

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
      length {c |}{res}        78    15.72397    24.75778        .03        121
   {txt}medlength {c |}{res}        78           5           0          5          5
{txt}
{com}. * mean length is 15.724
. * median length is 5
. * pred length from naiive (constant only) model on the TVC model is 6.071
. 
. gen fullerror=preddurfull-length
{txt}
{com}. gen naierror=preddurnaiive-length
{txt}
{com}. gen absfullerr=abs(fullerror)
{txt}
{com}. gen absnaierr=abs(naierror)
{txt}
{com}. egen totabsfullerr = sum(absfullerr)
{txt}
{com}. egen totabsnaierr = sum(absnaierr)
{txt}
{com}. 
. egen meanabsfullerr = mean(absfullerr)
{txt}
{com}. egen medabsfullerr = median(absfullerr)
{txt}
{com}. egen meanabsnaierr = mean(absnaierr)
{txt}
{com}. egen medabsnaierr = median(absnaierr)
{txt}
{com}. 
. label var meanabsfullerr "Mean absolute errors, full model"
{txt}
{com}. label var medabsfullerr "Median absolute errors, full model"
{txt}
{com}. label var meanabsnaierr "Mean of absolute errors, naiive model"
{txt}
{com}. label var medabsnaierr "Median of absolute errors, naiive model"
{txt}
{com}. 
. * summarize errors to get mean of errors, absolute errors, and sd.
. sum fullerror naierror absfullerr absnaierr

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
   fullerror {c |}{res}        78   -9.378351    24.71905  -116.7758   10.52666
    {txt}naierror {c |}{res}        78   -9.651991    24.75778   -114.928   6.041983
  {txt}absfullerr {c |}{res}        78    13.82626    22.50508   .0598068   116.7758
   {txt}absnaierr {c |}{res}        78    13.82925    22.66245   .0719833    114.928
{txt}
{com}. sum meanabsfullerr medabsfullerr meanabsnaierr medabsnaierr

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
meanabsful~r {c |}{res}        78    13.82626           0   13.82626   13.82626
{txt}medabsfull~r {c |}{res}        78    4.090219           0   4.090219   4.090219
{txt}meanabsnai~r {c |}{res}        78    13.82925           0   13.82925   13.82925
{txt}medabsnaierr {c |}{res}        78    5.071983           0   5.071983   5.071983
{txt}
{com}. 
. 
. 
. * Now compute error as % of length.  It turns out this is not a great measure, because 
. * error can be greater than length.  Then, 2.5 (e.g.) means the error is 2.5x the length.
. * This may not be a good measure then, because you are automatically very wrong for the shortest wars.
. * e.g. in a 1 month war, a 6 month error leads to a 600% (bad) error, while in a 12 month war, that 
. * same error is a 50% error.
. * BUT, our model still does much better than the naiive model here.
. gen pctactabsfullerr = absfullerr/length
{txt}
{com}. gen pctactabsnaierr = absnaierr/length
{txt}
{com}. egen meanpctactabsfullerr = mean(pctactabsfullerr )
{txt}
{com}. egen meanpctactabsnaierr = mean(pctactabsnaierr )
{txt}
{com}. label var meanpctactabsfullerr "Mean of absolute errors, full model, as pct of length"
{txt}
{com}. label var meanpctactabsnaierr "Mean absolute errors, naiive model, as pct of length"
{txt}
{com}. 
. * Look at error as pct of length.
. sum pctactabsfullerr pctactabsnaierr meanpctactabsfullerr meanpctactabsnaierr 

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
pctactabsf~r {c |}{res}        78    6.666961    19.07495   .0119614    137.465
{txt}pctactabsn~r {c |}{res}        78     9.97074    33.61596   .0119972   201.3994
{txt}meanpct~lerr {c |}{res}        78    6.666961           0   6.666961   6.666961
{txt}meanpct~ierr {c |}{res}        78     9.97074           0    9.97074    9.97074
{txt}
{com}. 
. 
. 
. * Now generate total errors from naiive model, total errors from our model, and can do PRE.
. * PRE:  (error1 - error2) / error1
. egen totalnaiiveerrors=sum(absnaierr)
{txt}
{com}. egen totalfullerrors=sum(absfullerr)
{txt}
{com}. gen PRE=(totalnaiiveerrors - totalfullerrors)/totalnaiiveerrors
{txt}
{com}. label var totalnaiiveerrors "Total of absolute errors, naiive model"
{txt}
{com}. label var totalfullerrors "Total of absolute errors, full model"
{txt}
{com}. label var PRE "Prop. reduction in total errors"
{txt}
{com}. 
. sum totalnaiiveerrors totalfullerrors PRE

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
totalnaiiv~s {c |}{res}        78    1078.682           0   1078.682   1078.682
{txt}totalfulle~s {c |}{res}        78    1078.448           0   1078.448   1078.448
         {txt}PRE {c |}{res}        78    .0002164           0   .0002164   .0002164
{txt}
{com}. 
{txt}end of do-file

{com}. exit, clear
